grevaillot/svd_tools/headers/STM32H753x/dfsdm.h
#pragma once 

/* --- DFSDM: Digital filter for sigma delta modulators ------------- */

/** @defgroup dfsdm_registers Digital filter for sigma delta
      modulators Register
@{*/

/** DFSDM_DFSDM_CHCFG0R1 DFSDM channel configuration 0 register 1 **/
#define DFSDM_DFSDM_CHCFG0R1			MMIO32(DFSDM_BASE + 0x00)
/** DFSDM_DFSDM_CHCFG1R1 DFSDM channel configuration 1 register 1 **/
#define DFSDM_DFSDM_CHCFG1R1			MMIO32(DFSDM_BASE + 0x04)
/** DFSDM_DFSDM_CHCFG2R1 DFSDM channel configuration 2 register 1 **/
#define DFSDM_DFSDM_CHCFG2R1			MMIO32(DFSDM_BASE + 0x08)
/** DFSDM_DFSDM_CHCFG3R1 DFSDM channel configuration 3 register 1 **/
#define DFSDM_DFSDM_CHCFG3R1			MMIO32(DFSDM_BASE + 0x0c)
/** DFSDM_DFSDM_CHCFG4R1 DFSDM channel configuration 4 register 1 **/
#define DFSDM_DFSDM_CHCFG4R1			MMIO32(DFSDM_BASE + 0x10)
/** DFSDM_DFSDM_CHCFG5R1 DFSDM channel configuration 5 register 1 **/
#define DFSDM_DFSDM_CHCFG5R1			MMIO32(DFSDM_BASE + 0x14)
/** DFSDM_DFSDM_CHCFG6R1 DFSDM channel configuration 6 register 1 **/
#define DFSDM_DFSDM_CHCFG6R1			MMIO32(DFSDM_BASE + 0x18)
/** DFSDM_DFSDM_CHCFG7R1 DFSDM channel configuration 7 register 1 **/
#define DFSDM_DFSDM_CHCFG7R1			MMIO32(DFSDM_BASE + 0x1c)
/** DFSDM_DFSDM_CHCFG0R2 DFSDM channel configuration 0 register 2 **/
#define DFSDM_DFSDM_CHCFG0R2			MMIO32(DFSDM_BASE + 0x20)
/** DFSDM_DFSDM_CHCFG1R2 DFSDM channel configuration 1 register 2 **/
#define DFSDM_DFSDM_CHCFG1R2			MMIO32(DFSDM_BASE + 0x24)
/** DFSDM_DFSDM_CHCFG2R2 DFSDM channel configuration 2 register 2 **/
#define DFSDM_DFSDM_CHCFG2R2			MMIO32(DFSDM_BASE + 0x28)
/** DFSDM_DFSDM_CHCFG3R2 DFSDM channel configuration 3 register 2 **/
#define DFSDM_DFSDM_CHCFG3R2			MMIO32(DFSDM_BASE + 0x2c)
/** DFSDM_DFSDM_CHCFG4R2 DFSDM channel configuration 4 register 2 **/
#define DFSDM_DFSDM_CHCFG4R2			MMIO32(DFSDM_BASE + 0x30)
/** DFSDM_DFSDM_CHCFG5R2 DFSDM channel configuration 5 register 2 **/
#define DFSDM_DFSDM_CHCFG5R2			MMIO32(DFSDM_BASE + 0x34)
/** DFSDM_DFSDM_CHCFG6R2 DFSDM channel configuration 6 register 2 **/
#define DFSDM_DFSDM_CHCFG6R2			MMIO32(DFSDM_BASE + 0x38)
/** DFSDM_DFSDM_CHCFG7R2 DFSDM channel configuration 7 register 2 **/
#define DFSDM_DFSDM_CHCFG7R2			MMIO32(DFSDM_BASE + 0x3c)
/** DFSDM_DFSDM_AWSCD0R DFSDM analog watchdog and short-circuit detector register **/
#define DFSDM_DFSDM_AWSCD0R			MMIO32(DFSDM_BASE + 0x40)
/** DFSDM_DFSDM_AWSCD1R DFSDM analog watchdog and short-circuit detector register **/
#define DFSDM_DFSDM_AWSCD1R			MMIO32(DFSDM_BASE + 0x44)
/** DFSDM_DFSDM_AWSCD2R DFSDM analog watchdog and short-circuit detector register **/
#define DFSDM_DFSDM_AWSCD2R			MMIO32(DFSDM_BASE + 0x48)
/** DFSDM_DFSDM_AWSCD3R DFSDM analog watchdog and short-circuit detector register **/
#define DFSDM_DFSDM_AWSCD3R			MMIO32(DFSDM_BASE + 0x4c)
/** DFSDM_DFSDM_AWSCD4R DFSDM analog watchdog and short-circuit detector register **/
#define DFSDM_DFSDM_AWSCD4R			MMIO32(DFSDM_BASE + 0x50)
/** DFSDM_DFSDM_AWSCD5R DFSDM analog watchdog and short-circuit detector register **/
#define DFSDM_DFSDM_AWSCD5R			MMIO32(DFSDM_BASE + 0x54)
/** DFSDM_DFSDM_AWSCD6R DFSDM analog watchdog and short-circuit detector register **/
#define DFSDM_DFSDM_AWSCD6R			MMIO32(DFSDM_BASE + 0x58)
/** DFSDM_DFSDM_AWSCD7R DFSDM analog watchdog and short-circuit detector register **/
#define DFSDM_DFSDM_AWSCD7R			MMIO32(DFSDM_BASE + 0x5c)
/** DFSDM_DFSDM_CHWDAT0R DFSDM channel watchdog filter data register **/
#define DFSDM_DFSDM_CHWDAT0R			MMIO32(DFSDM_BASE + 0x60)
/** DFSDM_DFSDM_CHWDAT1R DFSDM channel watchdog filter data register **/
#define DFSDM_DFSDM_CHWDAT1R			MMIO32(DFSDM_BASE + 0x64)
/** DFSDM_DFSDM_CHWDAT2R DFSDM channel watchdog filter data register **/
#define DFSDM_DFSDM_CHWDAT2R			MMIO32(DFSDM_BASE + 0x68)
/** DFSDM_DFSDM_CHWDAT3R DFSDM channel watchdog filter data register **/
#define DFSDM_DFSDM_CHWDAT3R			MMIO32(DFSDM_BASE + 0x6c)
/** DFSDM_DFSDM_CHWDAT4R DFSDM channel watchdog filter data register **/
#define DFSDM_DFSDM_CHWDAT4R			MMIO32(DFSDM_BASE + 0x70)
/** DFSDM_DFSDM_CHWDAT5R DFSDM channel watchdog filter data register **/
#define DFSDM_DFSDM_CHWDAT5R			MMIO32(DFSDM_BASE + 0x74)
/** DFSDM_DFSDM_CHWDAT6R DFSDM channel watchdog filter data register **/
#define DFSDM_DFSDM_CHWDAT6R			MMIO32(DFSDM_BASE + 0x78)
/** DFSDM_DFSDM_CHWDAT7R DFSDM channel watchdog filter data register **/
#define DFSDM_DFSDM_CHWDAT7R			MMIO32(DFSDM_BASE + 0x7c)
/** DFSDM_DFSDM_CHDATIN0R DFSDM channel data input register **/
#define DFSDM_DFSDM_CHDATIN0R			MMIO32(DFSDM_BASE + 0x80)
/** DFSDM_DFSDM_CHDATIN1R DFSDM channel data input register **/
#define DFSDM_DFSDM_CHDATIN1R			MMIO32(DFSDM_BASE + 0x84)
/** DFSDM_DFSDM_CHDATIN2R DFSDM channel data input register **/
#define DFSDM_DFSDM_CHDATIN2R			MMIO32(DFSDM_BASE + 0x88)
/** DFSDM_DFSDM_CHDATIN3R DFSDM channel data input register **/
#define DFSDM_DFSDM_CHDATIN3R			MMIO32(DFSDM_BASE + 0x8c)
/** DFSDM_DFSDM_CHDATIN4R DFSDM channel data input register **/
#define DFSDM_DFSDM_CHDATIN4R			MMIO32(DFSDM_BASE + 0x90)
/** DFSDM_DFSDM_CHDATIN5R DFSDM channel data input register **/
#define DFSDM_DFSDM_CHDATIN5R			MMIO32(DFSDM_BASE + 0x94)
/** DFSDM_DFSDM_CHDATIN6R DFSDM channel data input register **/
#define DFSDM_DFSDM_CHDATIN6R			MMIO32(DFSDM_BASE + 0x98)
/** DFSDM_DFSDM_CHDATIN7R DFSDM channel data input register **/
#define DFSDM_DFSDM_CHDATIN7R			MMIO32(DFSDM_BASE + 0x9c)
/** DFSDM_DFSDM0_CR1 DFSDM control register 1 **/
#define DFSDM_DFSDM0_CR1			MMIO32(DFSDM_BASE + 0xa0)
/** DFSDM_DFSDM1_CR1 DFSDM control register 1 **/
#define DFSDM_DFSDM1_CR1			MMIO32(DFSDM_BASE + 0xa4)
/** DFSDM_DFSDM2_CR1 DFSDM control register 1 **/
#define DFSDM_DFSDM2_CR1			MMIO32(DFSDM_BASE + 0xa8)
/** DFSDM_DFSDM3_CR1 DFSDM control register 1 **/
#define DFSDM_DFSDM3_CR1			MMIO32(DFSDM_BASE + 0xac)
/** DFSDM_DFSDM0_CR2 DFSDM control register 2 **/
#define DFSDM_DFSDM0_CR2			MMIO32(DFSDM_BASE + 0xb0)
/** DFSDM_DFSDM1_CR2 DFSDM control register 2 **/
#define DFSDM_DFSDM1_CR2			MMIO32(DFSDM_BASE + 0xb4)
/** DFSDM_DFSDM2_CR2 DFSDM control register 2 **/
#define DFSDM_DFSDM2_CR2			MMIO32(DFSDM_BASE + 0xb8)
/** DFSDM_DFSDM3_CR2 DFSDM control register 2 **/
#define DFSDM_DFSDM3_CR2			MMIO32(DFSDM_BASE + 0xbc)
/** DFSDM_DFSDM0_ISR DFSDM interrupt and status register **/
#define DFSDM_DFSDM0_ISR			MMIO32(DFSDM_BASE + 0xc0)
/** DFSDM_DFSDM1_ISR DFSDM interrupt and status register **/
#define DFSDM_DFSDM1_ISR			MMIO32(DFSDM_BASE + 0xc4)
/** DFSDM_DFSDM2_ISR DFSDM interrupt and status register **/
#define DFSDM_DFSDM2_ISR			MMIO32(DFSDM_BASE + 0xc8)
/** DFSDM_DFSDM3_ISR DFSDM interrupt and status register **/
#define DFSDM_DFSDM3_ISR			MMIO32(DFSDM_BASE + 0xcc)
/** DFSDM_DFSDM0_ICR DFSDM interrupt flag clear register **/
#define DFSDM_DFSDM0_ICR			MMIO32(DFSDM_BASE + 0xd0)
/** DFSDM_DFSDM1_ICR DFSDM interrupt flag clear register **/
#define DFSDM_DFSDM1_ICR			MMIO32(DFSDM_BASE + 0xd4)
/** DFSDM_DFSDM2_ICR DFSDM interrupt flag clear register **/
#define DFSDM_DFSDM2_ICR			MMIO32(DFSDM_BASE + 0xd8)
/** DFSDM_DFSDM3_ICR DFSDM interrupt flag clear register **/
#define DFSDM_DFSDM3_ICR			MMIO32(DFSDM_BASE + 0xdc)
/** DFSDM_DFSDM0_JCHGR DFSDM injected channel group selection register **/
#define DFSDM_DFSDM0_JCHGR			MMIO32(DFSDM_BASE + 0xe0)
/** DFSDM_DFSDM1_JCHGR DFSDM injected channel group selection register **/
#define DFSDM_DFSDM1_JCHGR			MMIO32(DFSDM_BASE + 0xe4)
/** DFSDM_DFSDM2_JCHGR DFSDM injected channel group selection register **/
#define DFSDM_DFSDM2_JCHGR			MMIO32(DFSDM_BASE + 0xe8)
/** DFSDM_DFSDM3_JCHGR DFSDM injected channel group selection register **/
#define DFSDM_DFSDM3_JCHGR			MMIO32(DFSDM_BASE + 0xec)
/** DFSDM_DFSDM0_FCR DFSDM filter control register **/
#define DFSDM_DFSDM0_FCR			MMIO32(DFSDM_BASE + 0xf0)
/** DFSDM_DFSDM1_FCR DFSDM filter control register **/
#define DFSDM_DFSDM1_FCR			MMIO32(DFSDM_BASE + 0xf4)
/** DFSDM_DFSDM2_FCR DFSDM filter control register **/
#define DFSDM_DFSDM2_FCR			MMIO32(DFSDM_BASE + 0xf8)
/** DFSDM_DFSDM3_FCR DFSDM filter control register **/
#define DFSDM_DFSDM3_FCR			MMIO32(DFSDM_BASE + 0xfc)
/** DFSDM_DFSDM0_JDATAR DFSDM data register for injected group **/
#define DFSDM_DFSDM0_JDATAR			MMIO32(DFSDM_BASE + 0x100)
/** DFSDM_DFSDM1_JDATAR DFSDM data register for injected group **/
#define DFSDM_DFSDM1_JDATAR			MMIO32(DFSDM_BASE + 0x104)
/** DFSDM_DFSDM2_JDATAR DFSDM data register for injected group **/
#define DFSDM_DFSDM2_JDATAR			MMIO32(DFSDM_BASE + 0x108)
/** DFSDM_DFSDM3_JDATAR DFSDM data register for injected group **/
#define DFSDM_DFSDM3_JDATAR			MMIO32(DFSDM_BASE + 0x10c)
/** DFSDM_DFSDM0_RDATAR DFSDM data register for the regular channel **/
#define DFSDM_DFSDM0_RDATAR			MMIO32(DFSDM_BASE + 0x110)
/** DFSDM_DFSDM1_RDATAR DFSDM data register for the regular channel **/
#define DFSDM_DFSDM1_RDATAR			MMIO32(DFSDM_BASE + 0x114)
/** DFSDM_DFSDM2_RDATAR DFSDM data register for the regular channel **/
#define DFSDM_DFSDM2_RDATAR			MMIO32(DFSDM_BASE + 0x118)
/** DFSDM_DFSDM3_RDATAR DFSDM data register for the regular channel **/
#define DFSDM_DFSDM3_RDATAR			MMIO32(DFSDM_BASE + 0x11c)
/** DFSDM_DFSDM0_AWHTR DFSDM analog watchdog high threshold register **/
#define DFSDM_DFSDM0_AWHTR			MMIO32(DFSDM_BASE + 0x120)
/** DFSDM_DFSDM1_AWHTR DFSDM analog watchdog high threshold register **/
#define DFSDM_DFSDM1_AWHTR			MMIO32(DFSDM_BASE + 0x124)
/** DFSDM_DFSDM2_AWHTR DFSDM analog watchdog high threshold register **/
#define DFSDM_DFSDM2_AWHTR			MMIO32(DFSDM_BASE + 0x128)
/** DFSDM_DFSDM3_AWHTR DFSDM analog watchdog high threshold register **/
#define DFSDM_DFSDM3_AWHTR			MMIO32(DFSDM_BASE + 0x12c)
/** DFSDM_DFSDM0_AWLTR DFSDM analog watchdog low threshold register **/
#define DFSDM_DFSDM0_AWLTR			MMIO32(DFSDM_BASE + 0x130)
/** DFSDM_DFSDM1_AWLTR DFSDM analog watchdog low threshold register **/
#define DFSDM_DFSDM1_AWLTR			MMIO32(DFSDM_BASE + 0x134)
/** DFSDM_DFSDM2_AWLTR DFSDM analog watchdog low threshold register **/
#define DFSDM_DFSDM2_AWLTR			MMIO32(DFSDM_BASE + 0x138)
/** DFSDM_DFSDM3_AWLTR DFSDM analog watchdog low threshold register **/
#define DFSDM_DFSDM3_AWLTR			MMIO32(DFSDM_BASE + 0x13c)
/** DFSDM_DFSDM0_AWSR DFSDM analog watchdog status register **/
#define DFSDM_DFSDM0_AWSR			MMIO32(DFSDM_BASE + 0x140)
/** DFSDM_DFSDM1_AWSR DFSDM analog watchdog status register **/
#define DFSDM_DFSDM1_AWSR			MMIO32(DFSDM_BASE + 0x144)
/** DFSDM_DFSDM2_AWSR DFSDM analog watchdog status register **/
#define DFSDM_DFSDM2_AWSR			MMIO32(DFSDM_BASE + 0x148)
/** DFSDM_DFSDM3_AWSR DFSDM analog watchdog status register **/
#define DFSDM_DFSDM3_AWSR			MMIO32(DFSDM_BASE + 0x14c)
/** DFSDM_DFSDM0_AWCFR DFSDM analog watchdog clear flag register **/
#define DFSDM_DFSDM0_AWCFR			MMIO32(DFSDM_BASE + 0x150)
/** DFSDM_DFSDM1_AWCFR DFSDM analog watchdog clear flag register **/
#define DFSDM_DFSDM1_AWCFR			MMIO32(DFSDM_BASE + 0x154)
/** DFSDM_DFSDM2_AWCFR DFSDM analog watchdog clear flag register **/
#define DFSDM_DFSDM2_AWCFR			MMIO32(DFSDM_BASE + 0x158)
/** DFSDM_DFSDM3_AWCFR DFSDM analog watchdog clear flag register **/
#define DFSDM_DFSDM3_AWCFR			MMIO32(DFSDM_BASE + 0x15c)
/** DFSDM_DFSDM0_EXMAX DFSDM Extremes detector maximum register **/
#define DFSDM_DFSDM0_EXMAX			MMIO32(DFSDM_BASE + 0x160)
/** DFSDM_DFSDM1_EXMAX DFSDM Extremes detector maximum register **/
#define DFSDM_DFSDM1_EXMAX			MMIO32(DFSDM_BASE + 0x164)
/** DFSDM_DFSDM2_EXMAX DFSDM Extremes detector maximum register **/
#define DFSDM_DFSDM2_EXMAX			MMIO32(DFSDM_BASE + 0x168)
/** DFSDM_DFSDM3_EXMAX DFSDM Extremes detector maximum register **/
#define DFSDM_DFSDM3_EXMAX			MMIO32(DFSDM_BASE + 0x16c)
/** DFSDM_DFSDM0_EXMIN DFSDM Extremes detector minimum register **/
#define DFSDM_DFSDM0_EXMIN			MMIO32(DFSDM_BASE + 0x170)
/** DFSDM_DFSDM1_EXMIN DFSDM Extremes detector minimum register **/
#define DFSDM_DFSDM1_EXMIN			MMIO32(DFSDM_BASE + 0x174)
/** DFSDM_DFSDM2_EXMIN DFSDM Extremes detector minimum register **/
#define DFSDM_DFSDM2_EXMIN			MMIO32(DFSDM_BASE + 0x178)
/** DFSDM_DFSDM3_EXMIN DFSDM Extremes detector minimum register **/
#define DFSDM_DFSDM3_EXMIN			MMIO32(DFSDM_BASE + 0x17c)
/** DFSDM_DFSDM0_CNVTIMR DFSDM conversion timer register **/
#define DFSDM_DFSDM0_CNVTIMR			MMIO32(DFSDM_BASE + 0x180)
/** DFSDM_DFSDM1_CNVTIMR DFSDM conversion timer register **/
#define DFSDM_DFSDM1_CNVTIMR			MMIO32(DFSDM_BASE + 0x184)
/** DFSDM_DFSDM2_CNVTIMR DFSDM conversion timer register **/
#define DFSDM_DFSDM2_CNVTIMR			MMIO32(DFSDM_BASE + 0x188)
/** DFSDM_DFSDM3_CNVTIMR DFSDM conversion timer register **/
#define DFSDM_DFSDM3_CNVTIMR			MMIO32(DFSDM_BASE + 0x18c)

/**@}*/


/** @defgroup dfsdm_dfsdm_chcfg0r1 DFSDMCHCFG0R1 DFSDM channel configuration 0 register 1
@{*/

/** DFSDM_DFSDM_CHCFG0R1_DFSDMEN Global enable for DFSDM interface **/
#define DFSDM_DFSDM_CHCFG0R1_DFSDMEN		(1 << 31)
/** DFSDM_DFSDM_CHCFG0R1_CKOUTSRC Output serial clock source selection **/
#define DFSDM_DFSDM_CHCFG0R1_CKOUTSRC		(1 << 30)

#define DFSDM_DFSDM_CHCFG0R1_CKOUTDIV_SHIFT		16
#define DFSDM_DFSDM_CHCFG0R1_CKOUTDIV_MASK		0xff
/** @defgroup dfsdm_dfsdm_chcfg0r1_ckoutdiv CKOUTDIV Output serial clock divider
@{*/
/**@}*/


#define DFSDM_DFSDM_CHCFG0R1_DATPACK_SHIFT		14
#define DFSDM_DFSDM_CHCFG0R1_DATPACK_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg0r1_datpack DATPACK Data packing mode in DFSDM_CHDATINyR register
@{*/
/**@}*/


