grevaillot/svd_tools/headers/STM32H753x/dfsdm.h
#define DFSDM_DFSDM_CHCFG0R1_DATMPX_SHIFT		12
#define DFSDM_DFSDM_CHCFG0R1_DATMPX_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg0r1_datmpx DATMPX Input data multiplexer for channel 0
@{*/
/**@}*/

/** DFSDM_DFSDM_CHCFG0R1_CHINSEL Channel inputs selection **/
#define DFSDM_DFSDM_CHCFG0R1_CHINSEL		(1 << 8)
/** DFSDM_DFSDM_CHCFG0R1_CHEN Channel 0 enable **/
#define DFSDM_DFSDM_CHCFG0R1_CHEN		(1 << 7)
/** DFSDM_DFSDM_CHCFG0R1_CKABEN Clock absence detector enable on channel 0 **/
#define DFSDM_DFSDM_CHCFG0R1_CKABEN		(1 << 6)
/** DFSDM_DFSDM_CHCFG0R1_SCDEN Short-circuit detector enable on channel 0 **/
#define DFSDM_DFSDM_CHCFG0R1_SCDEN		(1 << 5)

#define DFSDM_DFSDM_CHCFG0R1_SPICKSEL_SHIFT		2
#define DFSDM_DFSDM_CHCFG0R1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg0r1_spicksel SPICKSEL SPI clock select for channel 0
@{*/
/**@}*/


#define DFSDM_DFSDM_CHCFG0R1_SITP_SHIFT		0
#define DFSDM_DFSDM_CHCFG0R1_SITP_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg0r1_sitp SITP Serial interface type for channel 0
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_chcfg1r1 DFSDMCHCFG1R1 DFSDM channel configuration 1 register 1
@{*/

/** DFSDM_DFSDM_CHCFG1R1_DFSDMEN Global enable for DFSDM interface **/
#define DFSDM_DFSDM_CHCFG1R1_DFSDMEN		(1 << 31)
/** DFSDM_DFSDM_CHCFG1R1_CKOUTSRC Output serial clock source selection **/
#define DFSDM_DFSDM_CHCFG1R1_CKOUTSRC		(1 << 30)

#define DFSDM_DFSDM_CHCFG1R1_CKOUTDIV_SHIFT		16
#define DFSDM_DFSDM_CHCFG1R1_CKOUTDIV_MASK		0xff
/** @defgroup dfsdm_dfsdm_chcfg1r1_ckoutdiv CKOUTDIV Output serial clock divider
@{*/
/**@}*/


#define DFSDM_DFSDM_CHCFG1R1_DATPACK_SHIFT		14
#define DFSDM_DFSDM_CHCFG1R1_DATPACK_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg1r1_datpack DATPACK Data packing mode in DFSDM_CHDATINyR register
@{*/
/**@}*/


#define DFSDM_DFSDM_CHCFG1R1_DATMPX_SHIFT		12
#define DFSDM_DFSDM_CHCFG1R1_DATMPX_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg1r1_datmpx DATMPX Input data multiplexer for channel 1
@{*/
/**@}*/

/** DFSDM_DFSDM_CHCFG1R1_CHINSEL Channel inputs selection **/
#define DFSDM_DFSDM_CHCFG1R1_CHINSEL		(1 << 8)
/** DFSDM_DFSDM_CHCFG1R1_CHEN Channel 1 enable **/
#define DFSDM_DFSDM_CHCFG1R1_CHEN		(1 << 7)
/** DFSDM_DFSDM_CHCFG1R1_CKABEN Clock absence detector enable on channel 1 **/
#define DFSDM_DFSDM_CHCFG1R1_CKABEN		(1 << 6)
/** DFSDM_DFSDM_CHCFG1R1_SCDEN Short-circuit detector enable on channel 1 **/
#define DFSDM_DFSDM_CHCFG1R1_SCDEN		(1 << 5)

#define DFSDM_DFSDM_CHCFG1R1_SPICKSEL_SHIFT		2
#define DFSDM_DFSDM_CHCFG1R1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg1r1_spicksel SPICKSEL SPI clock select for channel 1
@{*/
/**@}*/


#define DFSDM_DFSDM_CHCFG1R1_SITP_SHIFT		0
#define DFSDM_DFSDM_CHCFG1R1_SITP_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg1r1_sitp SITP Serial interface type for channel 1
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_chcfg2r1 DFSDMCHCFG2R1 DFSDM channel configuration 2 register 1
@{*/

/** DFSDM_DFSDM_CHCFG2R1_DFSDMEN Global enable for DFSDM interface **/
#define DFSDM_DFSDM_CHCFG2R1_DFSDMEN		(1 << 31)
/** DFSDM_DFSDM_CHCFG2R1_CKOUTSRC Output serial clock source selection **/
#define DFSDM_DFSDM_CHCFG2R1_CKOUTSRC		(1 << 30)

#define DFSDM_DFSDM_CHCFG2R1_CKOUTDIV_SHIFT		16
#define DFSDM_DFSDM_CHCFG2R1_CKOUTDIV_MASK		0xff
/** @defgroup dfsdm_dfsdm_chcfg2r1_ckoutdiv CKOUTDIV Output serial clock divider
@{*/
/**@}*/


#define DFSDM_DFSDM_CHCFG2R1_DATPACK_SHIFT		14
#define DFSDM_DFSDM_CHCFG2R1_DATPACK_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg2r1_datpack DATPACK Data packing mode in DFSDM_CHDATINyR register
@{*/
/**@}*/


#define DFSDM_DFSDM_CHCFG2R1_DATMPX_SHIFT		12
#define DFSDM_DFSDM_CHCFG2R1_DATMPX_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg2r1_datmpx DATMPX Input data multiplexer for channel 2
@{*/
/**@}*/

/** DFSDM_DFSDM_CHCFG2R1_CHINSEL Channel inputs selection **/
#define DFSDM_DFSDM_CHCFG2R1_CHINSEL		(1 << 8)
/** DFSDM_DFSDM_CHCFG2R1_CHEN Channel 2 enable **/
#define DFSDM_DFSDM_CHCFG2R1_CHEN		(1 << 7)
/** DFSDM_DFSDM_CHCFG2R1_CKABEN Clock absence detector enable on channel 2 **/
#define DFSDM_DFSDM_CHCFG2R1_CKABEN		(1 << 6)
/** DFSDM_DFSDM_CHCFG2R1_SCDEN Short-circuit detector enable on channel 2 **/
#define DFSDM_DFSDM_CHCFG2R1_SCDEN		(1 << 5)

#define DFSDM_DFSDM_CHCFG2R1_SPICKSEL_SHIFT		2
#define DFSDM_DFSDM_CHCFG2R1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg2r1_spicksel SPICKSEL SPI clock select for channel 2
@{*/
/**@}*/


#define DFSDM_DFSDM_CHCFG2R1_SITP_SHIFT		0
#define DFSDM_DFSDM_CHCFG2R1_SITP_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg2r1_sitp SITP Serial interface type for channel 2
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_chcfg3r1 DFSDMCHCFG3R1 DFSDM channel configuration 3 register 1
@{*/

/** DFSDM_DFSDM_CHCFG3R1_DFSDMEN Global enable for DFSDM interface **/
#define DFSDM_DFSDM_CHCFG3R1_DFSDMEN		(1 << 31)
/** DFSDM_DFSDM_CHCFG3R1_CKOUTSRC Output serial clock source selection **/
#define DFSDM_DFSDM_CHCFG3R1_CKOUTSRC		(1 << 30)

#define DFSDM_DFSDM_CHCFG3R1_CKOUTDIV_SHIFT		16
#define DFSDM_DFSDM_CHCFG3R1_CKOUTDIV_MASK		0xff
/** @defgroup dfsdm_dfsdm_chcfg3r1_ckoutdiv CKOUTDIV Output serial clock divider
@{*/
/**@}*/


#define DFSDM_DFSDM_CHCFG3R1_DATPACK_SHIFT		14
#define DFSDM_DFSDM_CHCFG3R1_DATPACK_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg3r1_datpack DATPACK Data packing mode in DFSDM_CHDATINyR register
@{*/
/**@}*/


#define DFSDM_DFSDM_CHCFG3R1_DATMPX_SHIFT		12
#define DFSDM_DFSDM_CHCFG3R1_DATMPX_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg3r1_datmpx DATMPX Input data multiplexer for channel 3
@{*/
/**@}*/

/** DFSDM_DFSDM_CHCFG3R1_CHINSEL Channel inputs selection **/
#define DFSDM_DFSDM_CHCFG3R1_CHINSEL		(1 << 8)
/** DFSDM_DFSDM_CHCFG3R1_CHEN Channel 3 enable **/
#define DFSDM_DFSDM_CHCFG3R1_CHEN		(1 << 7)
/** DFSDM_DFSDM_CHCFG3R1_CKABEN Clock absence detector enable on channel 3 **/
#define DFSDM_DFSDM_CHCFG3R1_CKABEN		(1 << 6)
/** DFSDM_DFSDM_CHCFG3R1_SCDEN Short-circuit detector enable on channel 3 **/
#define DFSDM_DFSDM_CHCFG3R1_SCDEN		(1 << 5)

#define DFSDM_DFSDM_CHCFG3R1_SPICKSEL_SHIFT		2
#define DFSDM_DFSDM_CHCFG3R1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg3r1_spicksel SPICKSEL SPI clock select for channel 3
@{*/
/**@}*/


#define DFSDM_DFSDM_CHCFG3R1_SITP_SHIFT		0
#define DFSDM_DFSDM_CHCFG3R1_SITP_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg3r1_sitp SITP Serial interface type for channel 3
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_chcfg4r1 DFSDMCHCFG4R1 DFSDM channel configuration 4 register 1
@{*/

/** DFSDM_DFSDM_CHCFG4R1_DFSDMEN Global enable for DFSDM interface **/
#define DFSDM_DFSDM_CHCFG4R1_DFSDMEN		(1 << 31)
/** DFSDM_DFSDM_CHCFG4R1_CKOUTSRC Output serial clock source selection **/
#define DFSDM_DFSDM_CHCFG4R1_CKOUTSRC		(1 << 30)

#define DFSDM_DFSDM_CHCFG4R1_CKOUTDIV_SHIFT		16
#define DFSDM_DFSDM_CHCFG4R1_CKOUTDIV_MASK		0xff
/** @defgroup dfsdm_dfsdm_chcfg4r1_ckoutdiv CKOUTDIV Output serial clock divider
@{*/
/**@}*/


#define DFSDM_DFSDM_CHCFG4R1_DATPACK_SHIFT		14
#define DFSDM_DFSDM_CHCFG4R1_DATPACK_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg4r1_datpack DATPACK Data packing mode in DFSDM_CHDATINyR register
@{*/
/**@}*/


#define DFSDM_DFSDM_CHCFG4R1_DATMPX_SHIFT		12
#define DFSDM_DFSDM_CHCFG4R1_DATMPX_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg4r1_datmpx DATMPX Input data multiplexer for channel 4
@{*/
/**@}*/

/** DFSDM_DFSDM_CHCFG4R1_CHINSEL Channel inputs selection **/
#define DFSDM_DFSDM_CHCFG4R1_CHINSEL		(1 << 8)
/** DFSDM_DFSDM_CHCFG4R1_CHEN Channel 4 enable **/
#define DFSDM_DFSDM_CHCFG4R1_CHEN		(1 << 7)
/** DFSDM_DFSDM_CHCFG4R1_CKABEN Clock absence detector enable on channel 4 **/
#define DFSDM_DFSDM_CHCFG4R1_CKABEN		(1 << 6)
/** DFSDM_DFSDM_CHCFG4R1_SCDEN Short-circuit detector enable on channel 4 **/
#define DFSDM_DFSDM_CHCFG4R1_SCDEN		(1 << 5)

