grevaillot/svd_tools/headers/STM32H753x/dfsdm.h
#define DFSDM_DFSDM_CHCFG4R1_SPICKSEL_SHIFT		2
#define DFSDM_DFSDM_CHCFG4R1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg4r1_spicksel SPICKSEL SPI clock select for channel 4
@{*/
/**@}*/


#define DFSDM_DFSDM_CHCFG4R1_SITP_SHIFT		0
#define DFSDM_DFSDM_CHCFG4R1_SITP_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg4r1_sitp SITP Serial interface type for channel 4
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_chcfg5r1 DFSDMCHCFG5R1 DFSDM channel configuration 5 register 1
@{*/

/** DFSDM_DFSDM_CHCFG5R1_DFSDMEN Global enable for DFSDM interface **/
#define DFSDM_DFSDM_CHCFG5R1_DFSDMEN		(1 << 31)
/** DFSDM_DFSDM_CHCFG5R1_CKOUTSRC Output serial clock source selection **/
#define DFSDM_DFSDM_CHCFG5R1_CKOUTSRC		(1 << 30)

#define DFSDM_DFSDM_CHCFG5R1_CKOUTDIV_SHIFT		16
#define DFSDM_DFSDM_CHCFG5R1_CKOUTDIV_MASK		0xff
/** @defgroup dfsdm_dfsdm_chcfg5r1_ckoutdiv CKOUTDIV Output serial clock divider
@{*/
/**@}*/


#define DFSDM_DFSDM_CHCFG5R1_DATPACK_SHIFT		14
#define DFSDM_DFSDM_CHCFG5R1_DATPACK_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg5r1_datpack DATPACK Data packing mode in DFSDM_CHDATINyR register
@{*/
/**@}*/


#define DFSDM_DFSDM_CHCFG5R1_DATMPX_SHIFT		12
#define DFSDM_DFSDM_CHCFG5R1_DATMPX_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg5r1_datmpx DATMPX Input data multiplexer for channel 5
@{*/
/**@}*/

/** DFSDM_DFSDM_CHCFG5R1_CHINSEL Channel inputs selection **/
#define DFSDM_DFSDM_CHCFG5R1_CHINSEL		(1 << 8)
/** DFSDM_DFSDM_CHCFG5R1_CHEN Channel 5 enable **/
#define DFSDM_DFSDM_CHCFG5R1_CHEN		(1 << 7)
/** DFSDM_DFSDM_CHCFG5R1_CKABEN Clock absence detector enable on channel 5 **/
#define DFSDM_DFSDM_CHCFG5R1_CKABEN		(1 << 6)
/** DFSDM_DFSDM_CHCFG5R1_SCDEN Short-circuit detector enable on channel 5 **/
#define DFSDM_DFSDM_CHCFG5R1_SCDEN		(1 << 5)

#define DFSDM_DFSDM_CHCFG5R1_SPICKSEL_SHIFT		2
#define DFSDM_DFSDM_CHCFG5R1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg5r1_spicksel SPICKSEL SPI clock select for channel 5
@{*/
/**@}*/


#define DFSDM_DFSDM_CHCFG5R1_SITP_SHIFT		0
#define DFSDM_DFSDM_CHCFG5R1_SITP_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg5r1_sitp SITP Serial interface type for channel 5
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_chcfg6r1 DFSDMCHCFG6R1 DFSDM channel configuration 6 register 1
@{*/

/** DFSDM_DFSDM_CHCFG6R1_DFSDMEN Global enable for DFSDM interface **/
#define DFSDM_DFSDM_CHCFG6R1_DFSDMEN		(1 << 31)
/** DFSDM_DFSDM_CHCFG6R1_CKOUTSRC Output serial clock source selection **/
#define DFSDM_DFSDM_CHCFG6R1_CKOUTSRC		(1 << 30)

#define DFSDM_DFSDM_CHCFG6R1_CKOUTDIV_SHIFT		16
#define DFSDM_DFSDM_CHCFG6R1_CKOUTDIV_MASK		0xff
/** @defgroup dfsdm_dfsdm_chcfg6r1_ckoutdiv CKOUTDIV Output serial clock divider
@{*/
/**@}*/


#define DFSDM_DFSDM_CHCFG6R1_DATPACK_SHIFT		14
#define DFSDM_DFSDM_CHCFG6R1_DATPACK_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg6r1_datpack DATPACK Data packing mode in DFSDM_CHDATINyR register
@{*/
/**@}*/


#define DFSDM_DFSDM_CHCFG6R1_DATMPX_SHIFT		12
#define DFSDM_DFSDM_CHCFG6R1_DATMPX_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg6r1_datmpx DATMPX Input data multiplexer for channel 6
@{*/
/**@}*/

/** DFSDM_DFSDM_CHCFG6R1_CHINSEL Channel inputs selection **/
#define DFSDM_DFSDM_CHCFG6R1_CHINSEL		(1 << 8)
/** DFSDM_DFSDM_CHCFG6R1_CHEN Channel 6 enable **/
#define DFSDM_DFSDM_CHCFG6R1_CHEN		(1 << 7)
/** DFSDM_DFSDM_CHCFG6R1_CKABEN Clock absence detector enable on channel 6 **/
#define DFSDM_DFSDM_CHCFG6R1_CKABEN		(1 << 6)
/** DFSDM_DFSDM_CHCFG6R1_SCDEN Short-circuit detector enable on channel 6 **/
#define DFSDM_DFSDM_CHCFG6R1_SCDEN		(1 << 5)

#define DFSDM_DFSDM_CHCFG6R1_SPICKSEL_SHIFT		2
#define DFSDM_DFSDM_CHCFG6R1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg6r1_spicksel SPICKSEL SPI clock select for channel 6
@{*/
/**@}*/


#define DFSDM_DFSDM_CHCFG6R1_SITP_SHIFT		0
#define DFSDM_DFSDM_CHCFG6R1_SITP_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg6r1_sitp SITP Serial interface type for channel 6
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_chcfg7r1 DFSDMCHCFG7R1 DFSDM channel configuration 7 register 1
@{*/

/** DFSDM_DFSDM_CHCFG7R1_DFSDMEN Global enable for DFSDM interface **/
#define DFSDM_DFSDM_CHCFG7R1_DFSDMEN		(1 << 31)
/** DFSDM_DFSDM_CHCFG7R1_CKOUTSRC Output serial clock source selection **/
#define DFSDM_DFSDM_CHCFG7R1_CKOUTSRC		(1 << 30)

#define DFSDM_DFSDM_CHCFG7R1_CKOUTDIV_SHIFT		16
#define DFSDM_DFSDM_CHCFG7R1_CKOUTDIV_MASK		0xff
/** @defgroup dfsdm_dfsdm_chcfg7r1_ckoutdiv CKOUTDIV Output serial clock divider
@{*/
/**@}*/


#define DFSDM_DFSDM_CHCFG7R1_DATPACK_SHIFT		14
#define DFSDM_DFSDM_CHCFG7R1_DATPACK_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg7r1_datpack DATPACK Data packing mode in DFSDM_CHDATINyR register
@{*/
/**@}*/


#define DFSDM_DFSDM_CHCFG7R1_DATMPX_SHIFT		12
#define DFSDM_DFSDM_CHCFG7R1_DATMPX_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg7r1_datmpx DATMPX Input data multiplexer for channel 7
@{*/
/**@}*/

/** DFSDM_DFSDM_CHCFG7R1_CHINSEL Channel inputs selection **/
#define DFSDM_DFSDM_CHCFG7R1_CHINSEL		(1 << 8)
/** DFSDM_DFSDM_CHCFG7R1_CHEN Channel 7 enable **/
#define DFSDM_DFSDM_CHCFG7R1_CHEN		(1 << 7)
/** DFSDM_DFSDM_CHCFG7R1_CKABEN Clock absence detector enable on channel 7 **/
#define DFSDM_DFSDM_CHCFG7R1_CKABEN		(1 << 6)
/** DFSDM_DFSDM_CHCFG7R1_SCDEN Short-circuit detector enable on channel 7 **/
#define DFSDM_DFSDM_CHCFG7R1_SCDEN		(1 << 5)

#define DFSDM_DFSDM_CHCFG7R1_SPICKSEL_SHIFT		2
#define DFSDM_DFSDM_CHCFG7R1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg7r1_spicksel SPICKSEL SPI clock select for channel 7
@{*/
/**@}*/


#define DFSDM_DFSDM_CHCFG7R1_SITP_SHIFT		0
#define DFSDM_DFSDM_CHCFG7R1_SITP_MASK		0x03
/** @defgroup dfsdm_dfsdm_chcfg7r1_sitp SITP Serial interface type for channel 7
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_chcfg0r2 DFSDMCHCFG0R2 DFSDM channel configuration 0 register 2
@{*/


#define DFSDM_DFSDM_CHCFG0R2_OFFSET_SHIFT		8
#define DFSDM_DFSDM_CHCFG0R2_OFFSET_MASK		0xffffff
/** @defgroup dfsdm_dfsdm_chcfg0r2_offset OFFSET 24-bit calibration offset for channel 0
@{*/
/**@}*/


