grevaillot/svd_tools/headers/STM32H753x/dfsdm.h
#define DFSDM_DFSDM_CHCFG0R2_DTRBS_SHIFT		3
#define DFSDM_DFSDM_CHCFG0R2_DTRBS_MASK		0x1f
/** @defgroup dfsdm_dfsdm_chcfg0r2_dtrbs DTRBS Data right bit-shift for channel 0
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_chcfg1r2 DFSDMCHCFG1R2 DFSDM channel configuration 1 register 2
@{*/


#define DFSDM_DFSDM_CHCFG1R2_OFFSET_SHIFT		8
#define DFSDM_DFSDM_CHCFG1R2_OFFSET_MASK		0xffffff
/** @defgroup dfsdm_dfsdm_chcfg1r2_offset OFFSET 24-bit calibration offset for channel 1
@{*/
/**@}*/


#define DFSDM_DFSDM_CHCFG1R2_DTRBS_SHIFT		3
#define DFSDM_DFSDM_CHCFG1R2_DTRBS_MASK		0x1f
/** @defgroup dfsdm_dfsdm_chcfg1r2_dtrbs DTRBS Data right bit-shift for channel 1
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_chcfg2r2 DFSDMCHCFG2R2 DFSDM channel configuration 2 register 2
@{*/


#define DFSDM_DFSDM_CHCFG2R2_OFFSET_SHIFT		8
#define DFSDM_DFSDM_CHCFG2R2_OFFSET_MASK		0xffffff
/** @defgroup dfsdm_dfsdm_chcfg2r2_offset OFFSET 24-bit calibration offset for channel 2
@{*/
/**@}*/


#define DFSDM_DFSDM_CHCFG2R2_DTRBS_SHIFT		3
#define DFSDM_DFSDM_CHCFG2R2_DTRBS_MASK		0x1f
/** @defgroup dfsdm_dfsdm_chcfg2r2_dtrbs DTRBS Data right bit-shift for channel 2
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_chcfg3r2 DFSDMCHCFG3R2 DFSDM channel configuration 3 register 2
@{*/


#define DFSDM_DFSDM_CHCFG3R2_OFFSET_SHIFT		8
#define DFSDM_DFSDM_CHCFG3R2_OFFSET_MASK		0xffffff
/** @defgroup dfsdm_dfsdm_chcfg3r2_offset OFFSET 24-bit calibration offset for channel 3
@{*/
/**@}*/


#define DFSDM_DFSDM_CHCFG3R2_DTRBS_SHIFT		3
#define DFSDM_DFSDM_CHCFG3R2_DTRBS_MASK		0x1f
/** @defgroup dfsdm_dfsdm_chcfg3r2_dtrbs DTRBS Data right bit-shift for channel 3
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_chcfg4r2 DFSDMCHCFG4R2 DFSDM channel configuration 4 register 2
@{*/


#define DFSDM_DFSDM_CHCFG4R2_OFFSET_SHIFT		8
#define DFSDM_DFSDM_CHCFG4R2_OFFSET_MASK		0xffffff
/** @defgroup dfsdm_dfsdm_chcfg4r2_offset OFFSET 24-bit calibration offset for channel 4
@{*/
/**@}*/


#define DFSDM_DFSDM_CHCFG4R2_DTRBS_SHIFT		3
#define DFSDM_DFSDM_CHCFG4R2_DTRBS_MASK		0x1f
/** @defgroup dfsdm_dfsdm_chcfg4r2_dtrbs DTRBS Data right bit-shift for channel 4
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_chcfg5r2 DFSDMCHCFG5R2 DFSDM channel configuration 5 register 2
@{*/


#define DFSDM_DFSDM_CHCFG5R2_OFFSET_SHIFT		8
#define DFSDM_DFSDM_CHCFG5R2_OFFSET_MASK		0xffffff
/** @defgroup dfsdm_dfsdm_chcfg5r2_offset OFFSET 24-bit calibration offset for channel 5
@{*/
/**@}*/


#define DFSDM_DFSDM_CHCFG5R2_DTRBS_SHIFT		3
#define DFSDM_DFSDM_CHCFG5R2_DTRBS_MASK		0x1f
/** @defgroup dfsdm_dfsdm_chcfg5r2_dtrbs DTRBS Data right bit-shift for channel 5
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_chcfg6r2 DFSDMCHCFG6R2 DFSDM channel configuration 6 register 2
@{*/


#define DFSDM_DFSDM_CHCFG6R2_OFFSET_SHIFT		8
#define DFSDM_DFSDM_CHCFG6R2_OFFSET_MASK		0xffffff
/** @defgroup dfsdm_dfsdm_chcfg6r2_offset OFFSET 24-bit calibration offset for channel 6
@{*/
/**@}*/


#define DFSDM_DFSDM_CHCFG6R2_DTRBS_SHIFT		3
#define DFSDM_DFSDM_CHCFG6R2_DTRBS_MASK		0x1f
/** @defgroup dfsdm_dfsdm_chcfg6r2_dtrbs DTRBS Data right bit-shift for channel 6
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_chcfg7r2 DFSDMCHCFG7R2 DFSDM channel configuration 7 register 2
@{*/


#define DFSDM_DFSDM_CHCFG7R2_OFFSET_SHIFT		8
#define DFSDM_DFSDM_CHCFG7R2_OFFSET_MASK		0xffffff
/** @defgroup dfsdm_dfsdm_chcfg7r2_offset OFFSET 24-bit calibration offset for channel 7
@{*/
/**@}*/


#define DFSDM_DFSDM_CHCFG7R2_DTRBS_SHIFT		3
#define DFSDM_DFSDM_CHCFG7R2_DTRBS_MASK		0x1f
/** @defgroup dfsdm_dfsdm_chcfg7r2_dtrbs DTRBS Data right bit-shift for channel 7
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_awscd0r DFSDMAWSCD0R DFSDM analog watchdog and short-circuit detector register
@{*/


#define DFSDM_DFSDM_AWSCD0R_AWFORD_SHIFT		22
#define DFSDM_DFSDM_AWSCD0R_AWFORD_MASK		0x03
/** @defgroup dfsdm_dfsdm_awscd0r_awford AWFORD Analog watchdog Sinc filter order on channel 0
@{*/
/**@}*/


#define DFSDM_DFSDM_AWSCD0R_AWFOSR_SHIFT		16
#define DFSDM_DFSDM_AWSCD0R_AWFOSR_MASK		0x1f
/** @defgroup dfsdm_dfsdm_awscd0r_awfosr AWFOSR Analog watchdog filter oversampling ratio (decimation rate) on channel 0
@{*/
/**@}*/


#define DFSDM_DFSDM_AWSCD0R_BKSCD_SHIFT		12
#define DFSDM_DFSDM_AWSCD0R_BKSCD_MASK		0x0f
/** @defgroup dfsdm_dfsdm_awscd0r_bkscd BKSCD Break signal assignment for short-circuit detector on channel 0
@{*/
/**@}*/


#define DFSDM_DFSDM_AWSCD0R_SCDT_SHIFT		0
#define DFSDM_DFSDM_AWSCD0R_SCDT_MASK		0xff
/** @defgroup dfsdm_dfsdm_awscd0r_scdt SCDT short-circuit detector threshold for channel 0
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_awscd1r DFSDMAWSCD1R DFSDM analog watchdog and short-circuit detector register
@{*/


#define DFSDM_DFSDM_AWSCD1R_AWFORD_SHIFT		22
#define DFSDM_DFSDM_AWSCD1R_AWFORD_MASK		0x03
/** @defgroup dfsdm_dfsdm_awscd1r_awford AWFORD Analog watchdog Sinc filter order on channel 1
@{*/
/**@}*/


#define DFSDM_DFSDM_AWSCD1R_AWFOSR_SHIFT		16
#define DFSDM_DFSDM_AWSCD1R_AWFOSR_MASK		0x1f
/** @defgroup dfsdm_dfsdm_awscd1r_awfosr AWFOSR Analog watchdog filter oversampling ratio (decimation rate) on channel 1
@{*/
/**@}*/


#define DFSDM_DFSDM_AWSCD1R_BKSCD_SHIFT		12
#define DFSDM_DFSDM_AWSCD1R_BKSCD_MASK		0x0f
/** @defgroup dfsdm_dfsdm_awscd1r_bkscd BKSCD Break signal assignment for short-circuit detector on channel 1
@{*/
/**@}*/


#define DFSDM_DFSDM_AWSCD1R_SCDT_SHIFT		0
#define DFSDM_DFSDM_AWSCD1R_SCDT_MASK		0xff
/** @defgroup dfsdm_dfsdm_awscd1r_scdt SCDT short-circuit detector threshold for channel 1
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_awscd2r DFSDMAWSCD2R DFSDM analog watchdog and short-circuit detector register
@{*/


#define DFSDM_DFSDM_AWSCD2R_AWFORD_SHIFT		22
#define DFSDM_DFSDM_AWSCD2R_AWFORD_MASK		0x03
/** @defgroup dfsdm_dfsdm_awscd2r_awford AWFORD Analog watchdog Sinc filter order on channel 2
@{*/
/**@}*/


#define DFSDM_DFSDM_AWSCD2R_AWFOSR_SHIFT		16
#define DFSDM_DFSDM_AWSCD2R_AWFOSR_MASK		0x1f
/** @defgroup dfsdm_dfsdm_awscd2r_awfosr AWFOSR Analog watchdog filter oversampling ratio (decimation rate) on channel 2
@{*/
/**@}*/


