grevaillot/svd_tools/headers/STM32H753x/dfsdm.h
#define DFSDM_DFSDM_AWSCD2R_BKSCD_SHIFT		12
#define DFSDM_DFSDM_AWSCD2R_BKSCD_MASK		0x0f
/** @defgroup dfsdm_dfsdm_awscd2r_bkscd BKSCD Break signal assignment for short-circuit detector on channel 2
@{*/
/**@}*/


#define DFSDM_DFSDM_AWSCD2R_SCDT_SHIFT		0
#define DFSDM_DFSDM_AWSCD2R_SCDT_MASK		0xff
/** @defgroup dfsdm_dfsdm_awscd2r_scdt SCDT short-circuit detector threshold for channel 2
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_awscd3r DFSDMAWSCD3R DFSDM analog watchdog and short-circuit detector register
@{*/


#define DFSDM_DFSDM_AWSCD3R_AWFORD_SHIFT		22
#define DFSDM_DFSDM_AWSCD3R_AWFORD_MASK		0x03
/** @defgroup dfsdm_dfsdm_awscd3r_awford AWFORD Analog watchdog Sinc filter order on channel 3
@{*/
/**@}*/


#define DFSDM_DFSDM_AWSCD3R_AWFOSR_SHIFT		16
#define DFSDM_DFSDM_AWSCD3R_AWFOSR_MASK		0x1f
/** @defgroup dfsdm_dfsdm_awscd3r_awfosr AWFOSR Analog watchdog filter oversampling ratio (decimation rate) on channel 3
@{*/
/**@}*/


#define DFSDM_DFSDM_AWSCD3R_BKSCD_SHIFT		12
#define DFSDM_DFSDM_AWSCD3R_BKSCD_MASK		0x0f
/** @defgroup dfsdm_dfsdm_awscd3r_bkscd BKSCD Break signal assignment for short-circuit detector on channel 3
@{*/
/**@}*/


#define DFSDM_DFSDM_AWSCD3R_SCDT_SHIFT		0
#define DFSDM_DFSDM_AWSCD3R_SCDT_MASK		0xff
/** @defgroup dfsdm_dfsdm_awscd3r_scdt SCDT short-circuit detector threshold for channel 3
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_awscd4r DFSDMAWSCD4R DFSDM analog watchdog and short-circuit detector register
@{*/


#define DFSDM_DFSDM_AWSCD4R_AWFORD_SHIFT		22
#define DFSDM_DFSDM_AWSCD4R_AWFORD_MASK		0x03
/** @defgroup dfsdm_dfsdm_awscd4r_awford AWFORD Analog watchdog Sinc filter order on channel 4
@{*/
/**@}*/


#define DFSDM_DFSDM_AWSCD4R_AWFOSR_SHIFT		16
#define DFSDM_DFSDM_AWSCD4R_AWFOSR_MASK		0x1f
/** @defgroup dfsdm_dfsdm_awscd4r_awfosr AWFOSR Analog watchdog filter oversampling ratio (decimation rate) on channel 4
@{*/
/**@}*/


#define DFSDM_DFSDM_AWSCD4R_BKSCD_SHIFT		12
#define DFSDM_DFSDM_AWSCD4R_BKSCD_MASK		0x0f
/** @defgroup dfsdm_dfsdm_awscd4r_bkscd BKSCD Break signal assignment for short-circuit detector on channel 4
@{*/
/**@}*/


#define DFSDM_DFSDM_AWSCD4R_SCDT_SHIFT		0
#define DFSDM_DFSDM_AWSCD4R_SCDT_MASK		0xff
/** @defgroup dfsdm_dfsdm_awscd4r_scdt SCDT short-circuit detector threshold for channel 4
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_awscd5r DFSDMAWSCD5R DFSDM analog watchdog and short-circuit detector register
@{*/


#define DFSDM_DFSDM_AWSCD5R_AWFORD_SHIFT		22
#define DFSDM_DFSDM_AWSCD5R_AWFORD_MASK		0x03
/** @defgroup dfsdm_dfsdm_awscd5r_awford AWFORD Analog watchdog Sinc filter order on channel 5
@{*/
/**@}*/


#define DFSDM_DFSDM_AWSCD5R_AWFOSR_SHIFT		16
#define DFSDM_DFSDM_AWSCD5R_AWFOSR_MASK		0x1f
/** @defgroup dfsdm_dfsdm_awscd5r_awfosr AWFOSR Analog watchdog filter oversampling ratio (decimation rate) on channel 5
@{*/
/**@}*/


#define DFSDM_DFSDM_AWSCD5R_BKSCD_SHIFT		12
#define DFSDM_DFSDM_AWSCD5R_BKSCD_MASK		0x0f
/** @defgroup dfsdm_dfsdm_awscd5r_bkscd BKSCD Break signal assignment for short-circuit detector on channel 5
@{*/
/**@}*/


#define DFSDM_DFSDM_AWSCD5R_SCDT_SHIFT		0
#define DFSDM_DFSDM_AWSCD5R_SCDT_MASK		0xff
/** @defgroup dfsdm_dfsdm_awscd5r_scdt SCDT short-circuit detector threshold for channel 5
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_awscd6r DFSDMAWSCD6R DFSDM analog watchdog and short-circuit detector register
@{*/


#define DFSDM_DFSDM_AWSCD6R_AWFORD_SHIFT		22
#define DFSDM_DFSDM_AWSCD6R_AWFORD_MASK		0x03
/** @defgroup dfsdm_dfsdm_awscd6r_awford AWFORD Analog watchdog Sinc filter order on channel 6
@{*/
/**@}*/


#define DFSDM_DFSDM_AWSCD6R_AWFOSR_SHIFT		16
#define DFSDM_DFSDM_AWSCD6R_AWFOSR_MASK		0x1f
/** @defgroup dfsdm_dfsdm_awscd6r_awfosr AWFOSR Analog watchdog filter oversampling ratio (decimation rate) on channel 6
@{*/
/**@}*/


#define DFSDM_DFSDM_AWSCD6R_BKSCD_SHIFT		12
#define DFSDM_DFSDM_AWSCD6R_BKSCD_MASK		0x0f
/** @defgroup dfsdm_dfsdm_awscd6r_bkscd BKSCD Break signal assignment for short-circuit detector on channel 6
@{*/
/**@}*/


#define DFSDM_DFSDM_AWSCD6R_SCDT_SHIFT		0
#define DFSDM_DFSDM_AWSCD6R_SCDT_MASK		0xff
/** @defgroup dfsdm_dfsdm_awscd6r_scdt SCDT short-circuit detector threshold for channel 6
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_awscd7r DFSDMAWSCD7R DFSDM analog watchdog and short-circuit detector register
@{*/


#define DFSDM_DFSDM_AWSCD7R_AWFORD_SHIFT		22
#define DFSDM_DFSDM_AWSCD7R_AWFORD_MASK		0x03
/** @defgroup dfsdm_dfsdm_awscd7r_awford AWFORD Analog watchdog Sinc filter order on channel 7
@{*/
/**@}*/


#define DFSDM_DFSDM_AWSCD7R_AWFOSR_SHIFT		16
#define DFSDM_DFSDM_AWSCD7R_AWFOSR_MASK		0x1f
/** @defgroup dfsdm_dfsdm_awscd7r_awfosr AWFOSR Analog watchdog filter oversampling ratio (decimation rate) on channel 7
@{*/
/**@}*/


#define DFSDM_DFSDM_AWSCD7R_BKSCD_SHIFT		12
#define DFSDM_DFSDM_AWSCD7R_BKSCD_MASK		0x0f
/** @defgroup dfsdm_dfsdm_awscd7r_bkscd BKSCD Break signal assignment for short-circuit detector on channel 7
@{*/
/**@}*/


#define DFSDM_DFSDM_AWSCD7R_SCDT_SHIFT		0
#define DFSDM_DFSDM_AWSCD7R_SCDT_MASK		0xff
/** @defgroup dfsdm_dfsdm_awscd7r_scdt SCDT short-circuit detector threshold for channel 7
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_chwdat0r DFSDMCHWDAT0R DFSDM channel watchdog filter data register
@{*/


#define DFSDM_DFSDM_CHWDAT0R_WDATA_SHIFT		0
#define DFSDM_DFSDM_CHWDAT0R_WDATA_MASK		0xffff
/** @defgroup dfsdm_dfsdm_chwdat0r_wdata WDATA Input channel y watchdog data
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_chwdat1r DFSDMCHWDAT1R DFSDM channel watchdog filter data register
@{*/


#define DFSDM_DFSDM_CHWDAT1R_WDATA_SHIFT		0
#define DFSDM_DFSDM_CHWDAT1R_WDATA_MASK		0xffff
/** @defgroup dfsdm_dfsdm_chwdat1r_wdata WDATA Input channel y watchdog data
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_chwdat2r DFSDMCHWDAT2R DFSDM channel watchdog filter data register
@{*/


#define DFSDM_DFSDM_CHWDAT2R_WDATA_SHIFT		0
#define DFSDM_DFSDM_CHWDAT2R_WDATA_MASK		0xffff
/** @defgroup dfsdm_dfsdm_chwdat2r_wdata WDATA Input channel y watchdog data
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_chwdat3r DFSDMCHWDAT3R DFSDM channel watchdog filter data register
@{*/


#define DFSDM_DFSDM_CHWDAT3R_WDATA_SHIFT		0
#define DFSDM_DFSDM_CHWDAT3R_WDATA_MASK		0xffff
/** @defgroup dfsdm_dfsdm_chwdat3r_wdata WDATA Input channel y watchdog data
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_chwdat4r DFSDMCHWDAT4R DFSDM channel watchdog filter data register
@{*/


#define DFSDM_DFSDM_CHWDAT4R_WDATA_SHIFT		0
#define DFSDM_DFSDM_CHWDAT4R_WDATA_MASK		0xffff
/** @defgroup dfsdm_dfsdm_chwdat4r_wdata WDATA Input channel y watchdog data
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_chwdat5r DFSDMCHWDAT5R DFSDM channel watchdog filter data register
@{*/


#define DFSDM_DFSDM_CHWDAT5R_WDATA_SHIFT		0
#define DFSDM_DFSDM_CHWDAT5R_WDATA_MASK		0xffff
/** @defgroup dfsdm_dfsdm_chwdat5r_wdata WDATA Input channel y watchdog data
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_chwdat6r DFSDMCHWDAT6R DFSDM channel watchdog filter data register
@{*/


#define DFSDM_DFSDM_CHWDAT6R_WDATA_SHIFT		0
#define DFSDM_DFSDM_CHWDAT6R_WDATA_MASK		0xffff
/** @defgroup dfsdm_dfsdm_chwdat6r_wdata WDATA Input channel y watchdog data
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_chwdat7r DFSDMCHWDAT7R DFSDM channel watchdog filter data register
@{*/


#define DFSDM_DFSDM_CHWDAT7R_WDATA_SHIFT		0
#define DFSDM_DFSDM_CHWDAT7R_WDATA_MASK		0xffff
/** @defgroup dfsdm_dfsdm_chwdat7r_wdata WDATA Input channel y watchdog data
@{*/
/**@}*/


/**@}*/

