grevaillot/svd_tools/headers/STM32H753x/dfsdm.h
/** @defgroup dfsdm_dfsdm_chdatin0r DFSDMCHDATIN0R DFSDM channel data input register
@{*/


#define DFSDM_DFSDM_CHDATIN0R_INDAT1_SHIFT		16
#define DFSDM_DFSDM_CHDATIN0R_INDAT1_MASK		0xffff
/** @defgroup dfsdm_dfsdm_chdatin0r_indat1 INDAT1 Input data for channel 1
@{*/
/**@}*/


#define DFSDM_DFSDM_CHDATIN0R_INDAT0_SHIFT		0
#define DFSDM_DFSDM_CHDATIN0R_INDAT0_MASK		0xffff
/** @defgroup dfsdm_dfsdm_chdatin0r_indat0 INDAT0 Input data for channel 0
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_chdatin1r DFSDMCHDATIN1R DFSDM channel data input register
@{*/


#define DFSDM_DFSDM_CHDATIN1R_INDAT1_SHIFT		16
#define DFSDM_DFSDM_CHDATIN1R_INDAT1_MASK		0xffff
/** @defgroup dfsdm_dfsdm_chdatin1r_indat1 INDAT1 Input data for channel 2
@{*/
/**@}*/


#define DFSDM_DFSDM_CHDATIN1R_INDAT0_SHIFT		0
#define DFSDM_DFSDM_CHDATIN1R_INDAT0_MASK		0xffff
/** @defgroup dfsdm_dfsdm_chdatin1r_indat0 INDAT0 Input data for channel 1
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_chdatin2r DFSDMCHDATIN2R DFSDM channel data input register
@{*/


#define DFSDM_DFSDM_CHDATIN2R_INDAT1_SHIFT		16
#define DFSDM_DFSDM_CHDATIN2R_INDAT1_MASK		0xffff
/** @defgroup dfsdm_dfsdm_chdatin2r_indat1 INDAT1 Input data for channel 3
@{*/
/**@}*/


#define DFSDM_DFSDM_CHDATIN2R_INDAT0_SHIFT		0
#define DFSDM_DFSDM_CHDATIN2R_INDAT0_MASK		0xffff
/** @defgroup dfsdm_dfsdm_chdatin2r_indat0 INDAT0 Input data for channel 2
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_chdatin3r DFSDMCHDATIN3R DFSDM channel data input register
@{*/


#define DFSDM_DFSDM_CHDATIN3R_INDAT1_SHIFT		16
#define DFSDM_DFSDM_CHDATIN3R_INDAT1_MASK		0xffff
/** @defgroup dfsdm_dfsdm_chdatin3r_indat1 INDAT1 Input data for channel 4
@{*/
/**@}*/


#define DFSDM_DFSDM_CHDATIN3R_INDAT0_SHIFT		0
#define DFSDM_DFSDM_CHDATIN3R_INDAT0_MASK		0xffff
/** @defgroup dfsdm_dfsdm_chdatin3r_indat0 INDAT0 Input data for channel 3
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_chdatin4r DFSDMCHDATIN4R DFSDM channel data input register
@{*/


#define DFSDM_DFSDM_CHDATIN4R_INDAT1_SHIFT		16
#define DFSDM_DFSDM_CHDATIN4R_INDAT1_MASK		0xffff
/** @defgroup dfsdm_dfsdm_chdatin4r_indat1 INDAT1 Input data for channel 5
@{*/
/**@}*/


#define DFSDM_DFSDM_CHDATIN4R_INDAT0_SHIFT		0
#define DFSDM_DFSDM_CHDATIN4R_INDAT0_MASK		0xffff
/** @defgroup dfsdm_dfsdm_chdatin4r_indat0 INDAT0 Input data for channel 4
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_chdatin5r DFSDMCHDATIN5R DFSDM channel data input register
@{*/


#define DFSDM_DFSDM_CHDATIN5R_INDAT1_SHIFT		16
#define DFSDM_DFSDM_CHDATIN5R_INDAT1_MASK		0xffff
/** @defgroup dfsdm_dfsdm_chdatin5r_indat1 INDAT1 Input data for channel 6
@{*/
/**@}*/


#define DFSDM_DFSDM_CHDATIN5R_INDAT0_SHIFT		0
#define DFSDM_DFSDM_CHDATIN5R_INDAT0_MASK		0xffff
/** @defgroup dfsdm_dfsdm_chdatin5r_indat0 INDAT0 Input data for channel 5
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_chdatin6r DFSDMCHDATIN6R DFSDM channel data input register
@{*/


#define DFSDM_DFSDM_CHDATIN6R_INDAT1_SHIFT		16
#define DFSDM_DFSDM_CHDATIN6R_INDAT1_MASK		0xffff
/** @defgroup dfsdm_dfsdm_chdatin6r_indat1 INDAT1 Input data for channel 7
@{*/
/**@}*/


#define DFSDM_DFSDM_CHDATIN6R_INDAT0_SHIFT		0
#define DFSDM_DFSDM_CHDATIN6R_INDAT0_MASK		0xffff
/** @defgroup dfsdm_dfsdm_chdatin6r_indat0 INDAT0 Input data for channel 6
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm_chdatin7r DFSDMCHDATIN7R DFSDM channel data input register
@{*/


#define DFSDM_DFSDM_CHDATIN7R_INDAT1_SHIFT		16
#define DFSDM_DFSDM_CHDATIN7R_INDAT1_MASK		0xffff
/** @defgroup dfsdm_dfsdm_chdatin7r_indat1 INDAT1 Input data for channel 8
@{*/
/**@}*/


#define DFSDM_DFSDM_CHDATIN7R_INDAT0_SHIFT		0
#define DFSDM_DFSDM_CHDATIN7R_INDAT0_MASK		0xffff
/** @defgroup dfsdm_dfsdm_chdatin7r_indat0 INDAT0 Input data for channel 7
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm0_cr1 DFSDM0CR1 DFSDM control register 1
@{*/

/** DFSDM_DFSDM0_CR1_AWFSEL Analog watchdog fast mode select **/
#define DFSDM_DFSDM0_CR1_AWFSEL		(1 << 30)
/** DFSDM_DFSDM0_CR1_FAST Fast conversion mode selection for regular conversions **/
#define DFSDM_DFSDM0_CR1_FAST		(1 << 29)

#define DFSDM_DFSDM0_CR1_RCH_SHIFT		24
#define DFSDM_DFSDM0_CR1_RCH_MASK		0x07
/** @defgroup dfsdm_dfsdm0_cr1_rch RCH Regular channel selection
@{*/
/**@}*/

/** DFSDM_DFSDM0_CR1_RDMAEN DMA channel enabled to read data for the regular conversion **/
#define DFSDM_DFSDM0_CR1_RDMAEN		(1 << 21)
/** DFSDM_DFSDM0_CR1_RSYNC Launch regular conversion synchronously with DFSDM0 **/
#define DFSDM_DFSDM0_CR1_RSYNC		(1 << 19)
/** DFSDM_DFSDM0_CR1_RCONT Continuous mode selection for regular conversions **/
#define DFSDM_DFSDM0_CR1_RCONT		(1 << 18)
/** DFSDM_DFSDM0_CR1_RSWSTART Software start of a conversion on the regular channel **/
#define DFSDM_DFSDM0_CR1_RSWSTART		(1 << 17)

#define DFSDM_DFSDM0_CR1_JEXTEN_SHIFT		13
#define DFSDM_DFSDM0_CR1_JEXTEN_MASK		0x03
/** @defgroup dfsdm_dfsdm0_cr1_jexten JEXTEN Trigger enable and trigger edge selection for injected conversions
@{*/
/**@}*/


#define DFSDM_DFSDM0_CR1_JEXTSEL_SHIFT		8
#define DFSDM_DFSDM0_CR1_JEXTSEL_MASK		0x1f
/** @defgroup dfsdm_dfsdm0_cr1_jextsel JEXTSEL Trigger signal selection for launching injected conversions
@{*/
/**@}*/

/** DFSDM_DFSDM0_CR1_JDMAEN DMA channel enabled to read data for the injected channel group **/
#define DFSDM_DFSDM0_CR1_JDMAEN		(1 << 5)
/** DFSDM_DFSDM0_CR1_JSCAN Scanning conversion mode for injected conversions **/
#define DFSDM_DFSDM0_CR1_JSCAN		(1 << 4)
/** DFSDM_DFSDM0_CR1_JSYNC Launch an injected conversion synchronously with the DFSDM0 JSWSTART trigger **/
#define DFSDM_DFSDM0_CR1_JSYNC		(1 << 3)
/** DFSDM_DFSDM0_CR1_JSWSTART Start a conversion of the injected group of channels **/
#define DFSDM_DFSDM0_CR1_JSWSTART		(1 << 1)
/** DFSDM_DFSDM0_CR1_DFEN DFSDM enable **/
#define DFSDM_DFSDM0_CR1_DFEN		(1 << 0)

/**@}*/

/** @defgroup dfsdm_dfsdm1_cr1 DFSDM1CR1 DFSDM control register 1
@{*/

/** DFSDM_DFSDM1_CR1_AWFSEL Analog watchdog fast mode select **/
#define DFSDM_DFSDM1_CR1_AWFSEL		(1 << 30)
/** DFSDM_DFSDM1_CR1_FAST Fast conversion mode selection for regular conversions **/
#define DFSDM_DFSDM1_CR1_FAST		(1 << 29)

#define DFSDM_DFSDM1_CR1_RCH_SHIFT		24
#define DFSDM_DFSDM1_CR1_RCH_MASK		0x07
/** @defgroup dfsdm_dfsdm1_cr1_rch RCH Regular channel selection
@{*/
/**@}*/

