grevaillot/svd_tools/headers/STM32H753x/dfsdm.h
/** DFSDM_DFSDM1_CR1_RDMAEN DMA channel enabled to read data for the regular conversion **/
#define DFSDM_DFSDM1_CR1_RDMAEN		(1 << 21)
/** DFSDM_DFSDM1_CR1_RSYNC Launch regular conversion synchronously with DFSDM0 **/
#define DFSDM_DFSDM1_CR1_RSYNC		(1 << 19)
/** DFSDM_DFSDM1_CR1_RCONT Continuous mode selection for regular conversions **/
#define DFSDM_DFSDM1_CR1_RCONT		(1 << 18)
/** DFSDM_DFSDM1_CR1_RSWSTART Software start of a conversion on the regular channel **/
#define DFSDM_DFSDM1_CR1_RSWSTART		(1 << 17)

#define DFSDM_DFSDM1_CR1_JEXTEN_SHIFT		13
#define DFSDM_DFSDM1_CR1_JEXTEN_MASK		0x03
/** @defgroup dfsdm_dfsdm1_cr1_jexten JEXTEN Trigger enable and trigger edge selection for injected conversions
@{*/
/**@}*/


#define DFSDM_DFSDM1_CR1_JEXTSEL_SHIFT		8
#define DFSDM_DFSDM1_CR1_JEXTSEL_MASK		0x1f
/** @defgroup dfsdm_dfsdm1_cr1_jextsel JEXTSEL Trigger signal selection for launching injected conversions
@{*/
/**@}*/

/** DFSDM_DFSDM1_CR1_JDMAEN DMA channel enabled to read data for the injected channel group **/
#define DFSDM_DFSDM1_CR1_JDMAEN		(1 << 5)
/** DFSDM_DFSDM1_CR1_JSCAN Scanning conversion mode for injected conversions **/
#define DFSDM_DFSDM1_CR1_JSCAN		(1 << 4)
/** DFSDM_DFSDM1_CR1_JSYNC Launch an injected conversion synchronously with the DFSDM0 JSWSTART trigger **/
#define DFSDM_DFSDM1_CR1_JSYNC		(1 << 3)
/** DFSDM_DFSDM1_CR1_JSWSTART Start a conversion of the injected group of channels **/
#define DFSDM_DFSDM1_CR1_JSWSTART		(1 << 1)
/** DFSDM_DFSDM1_CR1_DFEN DFSDM enable **/
#define DFSDM_DFSDM1_CR1_DFEN		(1 << 0)

/**@}*/

/** @defgroup dfsdm_dfsdm2_cr1 DFSDM2CR1 DFSDM control register 1
@{*/

/** DFSDM_DFSDM2_CR1_AWFSEL Analog watchdog fast mode select **/
#define DFSDM_DFSDM2_CR1_AWFSEL		(1 << 30)
/** DFSDM_DFSDM2_CR1_FAST Fast conversion mode selection for regular conversions **/
#define DFSDM_DFSDM2_CR1_FAST		(1 << 29)

#define DFSDM_DFSDM2_CR1_RCH_SHIFT		24
#define DFSDM_DFSDM2_CR1_RCH_MASK		0x07
/** @defgroup dfsdm_dfsdm2_cr1_rch RCH Regular channel selection
@{*/
/**@}*/

/** DFSDM_DFSDM2_CR1_RDMAEN DMA channel enabled to read data for the regular conversion **/
#define DFSDM_DFSDM2_CR1_RDMAEN		(1 << 21)
/** DFSDM_DFSDM2_CR1_RSYNC Launch regular conversion synchronously with DFSDM0 **/
#define DFSDM_DFSDM2_CR1_RSYNC		(1 << 19)
/** DFSDM_DFSDM2_CR1_RCONT Continuous mode selection for regular conversions **/
#define DFSDM_DFSDM2_CR1_RCONT		(1 << 18)
/** DFSDM_DFSDM2_CR1_RSWSTART Software start of a conversion on the regular channel **/
#define DFSDM_DFSDM2_CR1_RSWSTART		(1 << 17)

#define DFSDM_DFSDM2_CR1_JEXTEN_SHIFT		13
#define DFSDM_DFSDM2_CR1_JEXTEN_MASK		0x03
/** @defgroup dfsdm_dfsdm2_cr1_jexten JEXTEN Trigger enable and trigger edge selection for injected conversions
@{*/
/**@}*/


#define DFSDM_DFSDM2_CR1_JEXTSEL_SHIFT		8
#define DFSDM_DFSDM2_CR1_JEXTSEL_MASK		0x1f
/** @defgroup dfsdm_dfsdm2_cr1_jextsel JEXTSEL Trigger signal selection for launching injected conversions
@{*/
/**@}*/

/** DFSDM_DFSDM2_CR1_JDMAEN DMA channel enabled to read data for the injected channel group **/
#define DFSDM_DFSDM2_CR1_JDMAEN		(1 << 5)
/** DFSDM_DFSDM2_CR1_JSCAN Scanning conversion mode for injected conversions **/
#define DFSDM_DFSDM2_CR1_JSCAN		(1 << 4)
/** DFSDM_DFSDM2_CR1_JSYNC Launch an injected conversion synchronously with the DFSDM0 JSWSTART trigger **/
#define DFSDM_DFSDM2_CR1_JSYNC		(1 << 3)
/** DFSDM_DFSDM2_CR1_JSWSTART Start a conversion of the injected group of channels **/
#define DFSDM_DFSDM2_CR1_JSWSTART		(1 << 1)
/** DFSDM_DFSDM2_CR1_DFEN DFSDM enable **/
#define DFSDM_DFSDM2_CR1_DFEN		(1 << 0)

/**@}*/

/** @defgroup dfsdm_dfsdm3_cr1 DFSDM3CR1 DFSDM control register 1
@{*/

/** DFSDM_DFSDM3_CR1_AWFSEL Analog watchdog fast mode select **/
#define DFSDM_DFSDM3_CR1_AWFSEL		(1 << 30)
/** DFSDM_DFSDM3_CR1_FAST Fast conversion mode selection for regular conversions **/
#define DFSDM_DFSDM3_CR1_FAST		(1 << 29)

#define DFSDM_DFSDM3_CR1_RCH_SHIFT		24
#define DFSDM_DFSDM3_CR1_RCH_MASK		0x07
/** @defgroup dfsdm_dfsdm3_cr1_rch RCH Regular channel selection
@{*/
/**@}*/

/** DFSDM_DFSDM3_CR1_RDMAEN DMA channel enabled to read data for the regular conversion **/
#define DFSDM_DFSDM3_CR1_RDMAEN		(1 << 21)
/** DFSDM_DFSDM3_CR1_RSYNC Launch regular conversion synchronously with DFSDM0 **/
#define DFSDM_DFSDM3_CR1_RSYNC		(1 << 19)
/** DFSDM_DFSDM3_CR1_RCONT Continuous mode selection for regular conversions **/
#define DFSDM_DFSDM3_CR1_RCONT		(1 << 18)
/** DFSDM_DFSDM3_CR1_RSWSTART Software start of a conversion on the regular channel **/
#define DFSDM_DFSDM3_CR1_RSWSTART		(1 << 17)

#define DFSDM_DFSDM3_CR1_JEXTEN_SHIFT		13
#define DFSDM_DFSDM3_CR1_JEXTEN_MASK		0x03
/** @defgroup dfsdm_dfsdm3_cr1_jexten JEXTEN Trigger enable and trigger edge selection for injected conversions
@{*/
/**@}*/


#define DFSDM_DFSDM3_CR1_JEXTSEL_SHIFT		8
#define DFSDM_DFSDM3_CR1_JEXTSEL_MASK		0x1f
/** @defgroup dfsdm_dfsdm3_cr1_jextsel JEXTSEL Trigger signal selection for launching injected conversions
@{*/
/**@}*/

/** DFSDM_DFSDM3_CR1_JDMAEN DMA channel enabled to read data for the injected channel group **/
#define DFSDM_DFSDM3_CR1_JDMAEN		(1 << 5)
/** DFSDM_DFSDM3_CR1_JSCAN Scanning conversion mode for injected conversions **/
#define DFSDM_DFSDM3_CR1_JSCAN		(1 << 4)
/** DFSDM_DFSDM3_CR1_JSYNC Launch an injected conversion synchronously with the DFSDM0 JSWSTART trigger **/
#define DFSDM_DFSDM3_CR1_JSYNC		(1 << 3)
/** DFSDM_DFSDM3_CR1_JSWSTART Start a conversion of the injected group of channels **/
#define DFSDM_DFSDM3_CR1_JSWSTART		(1 << 1)
/** DFSDM_DFSDM3_CR1_DFEN DFSDM enable **/
#define DFSDM_DFSDM3_CR1_DFEN		(1 << 0)

/**@}*/

/** @defgroup dfsdm_dfsdm0_cr2 DFSDM0CR2 DFSDM control register 2
@{*/


#define DFSDM_DFSDM0_CR2_AWDCH_SHIFT		16
#define DFSDM_DFSDM0_CR2_AWDCH_MASK		0xff
/** @defgroup dfsdm_dfsdm0_cr2_awdch AWDCH Analog watchdog channel selection
@{*/
/**@}*/


#define DFSDM_DFSDM0_CR2_EXCH_SHIFT		8
#define DFSDM_DFSDM0_CR2_EXCH_MASK		0xff
/** @defgroup dfsdm_dfsdm0_cr2_exch EXCH Extremes detector channel selection
@{*/
/**@}*/

/** DFSDM_DFSDM0_CR2_CKABIE Clock absence interrupt enable **/
#define DFSDM_DFSDM0_CR2_CKABIE		(1 << 6)
/** DFSDM_DFSDM0_CR2_SCDIE Short-circuit detector interrupt enable **/
#define DFSDM_DFSDM0_CR2_SCDIE		(1 << 5)
/** DFSDM_DFSDM0_CR2_AWDIE Analog watchdog interrupt enable **/
#define DFSDM_DFSDM0_CR2_AWDIE		(1 << 4)
/** DFSDM_DFSDM0_CR2_ROVRIE Regular data overrun interrupt enable **/
#define DFSDM_DFSDM0_CR2_ROVRIE		(1 << 3)
/** DFSDM_DFSDM0_CR2_JOVRIE Injected data overrun interrupt enable **/
#define DFSDM_DFSDM0_CR2_JOVRIE		(1 << 2)
/** DFSDM_DFSDM0_CR2_REOCIE Regular end of conversion interrupt enable **/
#define DFSDM_DFSDM0_CR2_REOCIE		(1 << 1)
/** DFSDM_DFSDM0_CR2_JEOCIE Injected end of conversion interrupt enable **/
#define DFSDM_DFSDM0_CR2_JEOCIE		(1 << 0)

/**@}*/

