grevaillot/svd_tools/headers/STM32H753x/dfsdm.h
/** @defgroup dfsdm_dfsdm1_cr2 DFSDM1CR2 DFSDM control register 2
@{*/


#define DFSDM_DFSDM1_CR2_AWDCH_SHIFT		16
#define DFSDM_DFSDM1_CR2_AWDCH_MASK		0xff
/** @defgroup dfsdm_dfsdm1_cr2_awdch AWDCH Analog watchdog channel selection
@{*/
/**@}*/


#define DFSDM_DFSDM1_CR2_EXCH_SHIFT		8
#define DFSDM_DFSDM1_CR2_EXCH_MASK		0xff
/** @defgroup dfsdm_dfsdm1_cr2_exch EXCH Extremes detector channel selection
@{*/
/**@}*/

/** DFSDM_DFSDM1_CR2_CKABIE Clock absence interrupt enable **/
#define DFSDM_DFSDM1_CR2_CKABIE		(1 << 6)
/** DFSDM_DFSDM1_CR2_SCDIE Short-circuit detector interrupt enable **/
#define DFSDM_DFSDM1_CR2_SCDIE		(1 << 5)
/** DFSDM_DFSDM1_CR2_AWDIE Analog watchdog interrupt enable **/
#define DFSDM_DFSDM1_CR2_AWDIE		(1 << 4)
/** DFSDM_DFSDM1_CR2_ROVRIE Regular data overrun interrupt enable **/
#define DFSDM_DFSDM1_CR2_ROVRIE		(1 << 3)
/** DFSDM_DFSDM1_CR2_JOVRIE Injected data overrun interrupt enable **/
#define DFSDM_DFSDM1_CR2_JOVRIE		(1 << 2)
/** DFSDM_DFSDM1_CR2_REOCIE Regular end of conversion interrupt enable **/
#define DFSDM_DFSDM1_CR2_REOCIE		(1 << 1)
/** DFSDM_DFSDM1_CR2_JEOCIE Injected end of conversion interrupt enable **/
#define DFSDM_DFSDM1_CR2_JEOCIE		(1 << 0)

/**@}*/

/** @defgroup dfsdm_dfsdm2_cr2 DFSDM2CR2 DFSDM control register 2
@{*/


#define DFSDM_DFSDM2_CR2_AWDCH_SHIFT		16
#define DFSDM_DFSDM2_CR2_AWDCH_MASK		0xff
/** @defgroup dfsdm_dfsdm2_cr2_awdch AWDCH Analog watchdog channel selection
@{*/
/**@}*/


#define DFSDM_DFSDM2_CR2_EXCH_SHIFT		8
#define DFSDM_DFSDM2_CR2_EXCH_MASK		0xff
/** @defgroup dfsdm_dfsdm2_cr2_exch EXCH Extremes detector channel selection
@{*/
/**@}*/

/** DFSDM_DFSDM2_CR2_CKABIE Clock absence interrupt enable **/
#define DFSDM_DFSDM2_CR2_CKABIE		(1 << 6)
/** DFSDM_DFSDM2_CR2_SCDIE Short-circuit detector interrupt enable **/
#define DFSDM_DFSDM2_CR2_SCDIE		(1 << 5)
/** DFSDM_DFSDM2_CR2_AWDIE Analog watchdog interrupt enable **/
#define DFSDM_DFSDM2_CR2_AWDIE		(1 << 4)
/** DFSDM_DFSDM2_CR2_ROVRIE Regular data overrun interrupt enable **/
#define DFSDM_DFSDM2_CR2_ROVRIE		(1 << 3)
/** DFSDM_DFSDM2_CR2_JOVRIE Injected data overrun interrupt enable **/
#define DFSDM_DFSDM2_CR2_JOVRIE		(1 << 2)
/** DFSDM_DFSDM2_CR2_REOCIE Regular end of conversion interrupt enable **/
#define DFSDM_DFSDM2_CR2_REOCIE		(1 << 1)
/** DFSDM_DFSDM2_CR2_JEOCIE Injected end of conversion interrupt enable **/
#define DFSDM_DFSDM2_CR2_JEOCIE		(1 << 0)

/**@}*/

/** @defgroup dfsdm_dfsdm3_cr2 DFSDM3CR2 DFSDM control register 2
@{*/


#define DFSDM_DFSDM3_CR2_AWDCH_SHIFT		16
#define DFSDM_DFSDM3_CR2_AWDCH_MASK		0xff
/** @defgroup dfsdm_dfsdm3_cr2_awdch AWDCH Analog watchdog channel selection
@{*/
/**@}*/


#define DFSDM_DFSDM3_CR2_EXCH_SHIFT		8
#define DFSDM_DFSDM3_CR2_EXCH_MASK		0xff
/** @defgroup dfsdm_dfsdm3_cr2_exch EXCH Extremes detector channel selection
@{*/
/**@}*/

/** DFSDM_DFSDM3_CR2_CKABIE Clock absence interrupt enable **/
#define DFSDM_DFSDM3_CR2_CKABIE		(1 << 6)
/** DFSDM_DFSDM3_CR2_SCDIE Short-circuit detector interrupt enable **/
#define DFSDM_DFSDM3_CR2_SCDIE		(1 << 5)
/** DFSDM_DFSDM3_CR2_AWDIE Analog watchdog interrupt enable **/
#define DFSDM_DFSDM3_CR2_AWDIE		(1 << 4)
/** DFSDM_DFSDM3_CR2_ROVRIE Regular data overrun interrupt enable **/
#define DFSDM_DFSDM3_CR2_ROVRIE		(1 << 3)
/** DFSDM_DFSDM3_CR2_JOVRIE Injected data overrun interrupt enable **/
#define DFSDM_DFSDM3_CR2_JOVRIE		(1 << 2)
/** DFSDM_DFSDM3_CR2_REOCIE Regular end of conversion interrupt enable **/
#define DFSDM_DFSDM3_CR2_REOCIE		(1 << 1)
/** DFSDM_DFSDM3_CR2_JEOCIE Injected end of conversion interrupt enable **/
#define DFSDM_DFSDM3_CR2_JEOCIE		(1 << 0)

/**@}*/

/** @defgroup dfsdm_dfsdm0_isr DFSDM0ISR DFSDM interrupt and status register
@{*/


#define DFSDM_DFSDM0_ISR_SCDF_SHIFT		24
#define DFSDM_DFSDM0_ISR_SCDF_MASK		0xff
/** @defgroup dfsdm_dfsdm0_isr_scdf SCDF short-circuit detector flag
@{*/
/**@}*/


#define DFSDM_DFSDM0_ISR_CKABF_SHIFT		16
#define DFSDM_DFSDM0_ISR_CKABF_MASK		0xff
/** @defgroup dfsdm_dfsdm0_isr_ckabf CKABF Clock absence flag
@{*/
/**@}*/

/** DFSDM_DFSDM0_ISR_RCIP Regular conversion in progress status **/
#define DFSDM_DFSDM0_ISR_RCIP		(1 << 14)
/** DFSDM_DFSDM0_ISR_JCIP Injected conversion in progress status **/
#define DFSDM_DFSDM0_ISR_JCIP		(1 << 13)
/** DFSDM_DFSDM0_ISR_AWDF Analog watchdog **/
#define DFSDM_DFSDM0_ISR_AWDF		(1 << 4)
/** DFSDM_DFSDM0_ISR_ROVRF Regular conversion overrun flag **/
#define DFSDM_DFSDM0_ISR_ROVRF		(1 << 3)
/** DFSDM_DFSDM0_ISR_JOVRF Injected conversion overrun flag **/
#define DFSDM_DFSDM0_ISR_JOVRF		(1 << 2)
/** DFSDM_DFSDM0_ISR_REOCF End of regular conversion flag **/
#define DFSDM_DFSDM0_ISR_REOCF		(1 << 1)
/** DFSDM_DFSDM0_ISR_JEOCF End of injected conversion flag **/
#define DFSDM_DFSDM0_ISR_JEOCF		(1 << 0)

/**@}*/

/** @defgroup dfsdm_dfsdm1_isr DFSDM1ISR DFSDM interrupt and status register
@{*/


#define DFSDM_DFSDM1_ISR_SCDF_SHIFT		24
#define DFSDM_DFSDM1_ISR_SCDF_MASK		0xff
/** @defgroup dfsdm_dfsdm1_isr_scdf SCDF short-circuit detector flag
@{*/
/**@}*/


#define DFSDM_DFSDM1_ISR_CKABF_SHIFT		16
#define DFSDM_DFSDM1_ISR_CKABF_MASK		0xff
/** @defgroup dfsdm_dfsdm1_isr_ckabf CKABF Clock absence flag
@{*/
/**@}*/

/** DFSDM_DFSDM1_ISR_RCIP Regular conversion in progress status **/
#define DFSDM_DFSDM1_ISR_RCIP		(1 << 14)
/** DFSDM_DFSDM1_ISR_JCIP Injected conversion in progress status **/
#define DFSDM_DFSDM1_ISR_JCIP		(1 << 13)
/** DFSDM_DFSDM1_ISR_AWDF Analog watchdog **/
#define DFSDM_DFSDM1_ISR_AWDF		(1 << 4)
/** DFSDM_DFSDM1_ISR_ROVRF Regular conversion overrun flag **/
#define DFSDM_DFSDM1_ISR_ROVRF		(1 << 3)
/** DFSDM_DFSDM1_ISR_JOVRF Injected conversion overrun flag **/
#define DFSDM_DFSDM1_ISR_JOVRF		(1 << 2)
/** DFSDM_DFSDM1_ISR_REOCF End of regular conversion flag **/
#define DFSDM_DFSDM1_ISR_REOCF		(1 << 1)
/** DFSDM_DFSDM1_ISR_JEOCF End of injected conversion flag **/
#define DFSDM_DFSDM1_ISR_JEOCF		(1 << 0)

/**@}*/

/** @defgroup dfsdm_dfsdm2_isr DFSDM2ISR DFSDM interrupt and status register
@{*/


#define DFSDM_DFSDM2_ISR_SCDF_SHIFT		24
#define DFSDM_DFSDM2_ISR_SCDF_MASK		0xff
/** @defgroup dfsdm_dfsdm2_isr_scdf SCDF short-circuit detector flag
@{*/
/**@}*/


#define DFSDM_DFSDM2_ISR_CKABF_SHIFT		16
#define DFSDM_DFSDM2_ISR_CKABF_MASK		0xff
/** @defgroup dfsdm_dfsdm2_isr_ckabf CKABF Clock absence flag
@{*/
/**@}*/

/** DFSDM_DFSDM2_ISR_RCIP Regular conversion in progress status **/
#define DFSDM_DFSDM2_ISR_RCIP		(1 << 14)
/** DFSDM_DFSDM2_ISR_JCIP Injected conversion in progress status **/
#define DFSDM_DFSDM2_ISR_JCIP		(1 << 13)
/** DFSDM_DFSDM2_ISR_AWDF Analog watchdog **/
#define DFSDM_DFSDM2_ISR_AWDF		(1 << 4)
/** DFSDM_DFSDM2_ISR_ROVRF Regular conversion overrun flag **/
#define DFSDM_DFSDM2_ISR_ROVRF		(1 << 3)
/** DFSDM_DFSDM2_ISR_JOVRF Injected conversion overrun flag **/
#define DFSDM_DFSDM2_ISR_JOVRF		(1 << 2)
/** DFSDM_DFSDM2_ISR_REOCF End of regular conversion flag **/
#define DFSDM_DFSDM2_ISR_REOCF		(1 << 1)
/** DFSDM_DFSDM2_ISR_JEOCF End of injected conversion flag **/
#define DFSDM_DFSDM2_ISR_JEOCF		(1 << 0)

/**@}*/

