grevaillot/svd_tools/headers/STM32H753x/dfsdm.h
/** @defgroup dfsdm_dfsdm3_isr DFSDM3ISR DFSDM interrupt and status register
@{*/


#define DFSDM_DFSDM3_ISR_SCDF_SHIFT		24
#define DFSDM_DFSDM3_ISR_SCDF_MASK		0xff
/** @defgroup dfsdm_dfsdm3_isr_scdf SCDF short-circuit detector flag
@{*/
/**@}*/


#define DFSDM_DFSDM3_ISR_CKABF_SHIFT		16
#define DFSDM_DFSDM3_ISR_CKABF_MASK		0xff
/** @defgroup dfsdm_dfsdm3_isr_ckabf CKABF Clock absence flag
@{*/
/**@}*/

/** DFSDM_DFSDM3_ISR_RCIP Regular conversion in progress status **/
#define DFSDM_DFSDM3_ISR_RCIP		(1 << 14)
/** DFSDM_DFSDM3_ISR_JCIP Injected conversion in progress status **/
#define DFSDM_DFSDM3_ISR_JCIP		(1 << 13)
/** DFSDM_DFSDM3_ISR_AWDF Analog watchdog **/
#define DFSDM_DFSDM3_ISR_AWDF		(1 << 4)
/** DFSDM_DFSDM3_ISR_ROVRF Regular conversion overrun flag **/
#define DFSDM_DFSDM3_ISR_ROVRF		(1 << 3)
/** DFSDM_DFSDM3_ISR_JOVRF Injected conversion overrun flag **/
#define DFSDM_DFSDM3_ISR_JOVRF		(1 << 2)
/** DFSDM_DFSDM3_ISR_REOCF End of regular conversion flag **/
#define DFSDM_DFSDM3_ISR_REOCF		(1 << 1)
/** DFSDM_DFSDM3_ISR_JEOCF End of injected conversion flag **/
#define DFSDM_DFSDM3_ISR_JEOCF		(1 << 0)

/**@}*/

/** @defgroup dfsdm_dfsdm0_icr DFSDM0ICR DFSDM interrupt flag clear register
@{*/


#define DFSDM_DFSDM0_ICR_CLRSCDF_SHIFT		24
#define DFSDM_DFSDM0_ICR_CLRSCDF_MASK		0xff
/** @defgroup dfsdm_dfsdm0_icr_clrscdf CLRSCDF Clear the short-circuit detector flag
@{*/
/**@}*/


#define DFSDM_DFSDM0_ICR_CLRCKABF_SHIFT		16
#define DFSDM_DFSDM0_ICR_CLRCKABF_MASK		0xff
/** @defgroup dfsdm_dfsdm0_icr_clrckabf CLRCKABF Clear the clock absence flag
@{*/
/**@}*/

/** DFSDM_DFSDM0_ICR_CLRROVRF Clear the regular conversion overrun flag **/
#define DFSDM_DFSDM0_ICR_CLRROVRF		(1 << 3)
/** DFSDM_DFSDM0_ICR_CLRJOVRF Clear the injected conversion overrun flag **/
#define DFSDM_DFSDM0_ICR_CLRJOVRF		(1 << 2)

/**@}*/

/** @defgroup dfsdm_dfsdm1_icr DFSDM1ICR DFSDM interrupt flag clear register
@{*/


#define DFSDM_DFSDM1_ICR_CLRSCDF_SHIFT		24
#define DFSDM_DFSDM1_ICR_CLRSCDF_MASK		0xff
/** @defgroup dfsdm_dfsdm1_icr_clrscdf CLRSCDF Clear the short-circuit detector flag
@{*/
/**@}*/


#define DFSDM_DFSDM1_ICR_CLRCKABF_SHIFT		16
#define DFSDM_DFSDM1_ICR_CLRCKABF_MASK		0xff
/** @defgroup dfsdm_dfsdm1_icr_clrckabf CLRCKABF Clear the clock absence flag
@{*/
/**@}*/

/** DFSDM_DFSDM1_ICR_CLRROVRF Clear the regular conversion overrun flag **/
#define DFSDM_DFSDM1_ICR_CLRROVRF		(1 << 3)
/** DFSDM_DFSDM1_ICR_CLRJOVRF Clear the injected conversion overrun flag **/
#define DFSDM_DFSDM1_ICR_CLRJOVRF		(1 << 2)

/**@}*/

/** @defgroup dfsdm_dfsdm2_icr DFSDM2ICR DFSDM interrupt flag clear register
@{*/


#define DFSDM_DFSDM2_ICR_CLRSCDF_SHIFT		24
#define DFSDM_DFSDM2_ICR_CLRSCDF_MASK		0xff
/** @defgroup dfsdm_dfsdm2_icr_clrscdf CLRSCDF Clear the short-circuit detector flag
@{*/
/**@}*/


#define DFSDM_DFSDM2_ICR_CLRCKABF_SHIFT		16
#define DFSDM_DFSDM2_ICR_CLRCKABF_MASK		0xff
/** @defgroup dfsdm_dfsdm2_icr_clrckabf CLRCKABF Clear the clock absence flag
@{*/
/**@}*/

/** DFSDM_DFSDM2_ICR_CLRROVRF Clear the regular conversion overrun flag **/
#define DFSDM_DFSDM2_ICR_CLRROVRF		(1 << 3)
/** DFSDM_DFSDM2_ICR_CLRJOVRF Clear the injected conversion overrun flag **/
#define DFSDM_DFSDM2_ICR_CLRJOVRF		(1 << 2)

/**@}*/

/** @defgroup dfsdm_dfsdm3_icr DFSDM3ICR DFSDM interrupt flag clear register
@{*/


#define DFSDM_DFSDM3_ICR_CLRSCDF_SHIFT		24
#define DFSDM_DFSDM3_ICR_CLRSCDF_MASK		0xff
/** @defgroup dfsdm_dfsdm3_icr_clrscdf CLRSCDF Clear the short-circuit detector flag
@{*/
/**@}*/


#define DFSDM_DFSDM3_ICR_CLRCKABF_SHIFT		16
#define DFSDM_DFSDM3_ICR_CLRCKABF_MASK		0xff
/** @defgroup dfsdm_dfsdm3_icr_clrckabf CLRCKABF Clear the clock absence flag
@{*/
/**@}*/

/** DFSDM_DFSDM3_ICR_CLRROVRF Clear the regular conversion overrun flag **/
#define DFSDM_DFSDM3_ICR_CLRROVRF		(1 << 3)
/** DFSDM_DFSDM3_ICR_CLRJOVRF Clear the injected conversion overrun flag **/
#define DFSDM_DFSDM3_ICR_CLRJOVRF		(1 << 2)

/**@}*/

/** @defgroup dfsdm_dfsdm0_jchgr DFSDM0JCHGR DFSDM injected channel group selection register
@{*/


#define DFSDM_DFSDM0_JCHGR_JCHG_SHIFT		0
#define DFSDM_DFSDM0_JCHGR_JCHG_MASK		0xff
/** @defgroup dfsdm_dfsdm0_jchgr_jchg JCHG Injected channel group selection
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm1_jchgr DFSDM1JCHGR DFSDM injected channel group selection register
@{*/


#define DFSDM_DFSDM1_JCHGR_JCHG_SHIFT		0
#define DFSDM_DFSDM1_JCHGR_JCHG_MASK		0xff
/** @defgroup dfsdm_dfsdm1_jchgr_jchg JCHG Injected channel group selection
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm2_jchgr DFSDM2JCHGR DFSDM injected channel group selection register
@{*/


#define DFSDM_DFSDM2_JCHGR_JCHG_SHIFT		0
#define DFSDM_DFSDM2_JCHGR_JCHG_MASK		0xff
/** @defgroup dfsdm_dfsdm2_jchgr_jchg JCHG Injected channel group selection
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm3_jchgr DFSDM3JCHGR DFSDM injected channel group selection register
@{*/


#define DFSDM_DFSDM3_JCHGR_JCHG_SHIFT		0
#define DFSDM_DFSDM3_JCHGR_JCHG_MASK		0xff
/** @defgroup dfsdm_dfsdm3_jchgr_jchg JCHG Injected channel group selection
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm0_fcr DFSDM0FCR DFSDM filter control register
@{*/


#define DFSDM_DFSDM0_FCR_FORD_SHIFT		29
#define DFSDM_DFSDM0_FCR_FORD_MASK		0x07
/** @defgroup dfsdm_dfsdm0_fcr_ford FORD Sinc filter order
@{*/
/**@}*/


#define DFSDM_DFSDM0_FCR_FOSR_SHIFT		16
#define DFSDM_DFSDM0_FCR_FOSR_MASK		0x3ff
/** @defgroup dfsdm_dfsdm0_fcr_fosr FOSR Sinc filter oversampling ratio (decimation rate)
@{*/
/**@}*/


#define DFSDM_DFSDM0_FCR_IOSR_SHIFT		0
#define DFSDM_DFSDM0_FCR_IOSR_MASK		0xff
/** @defgroup dfsdm_dfsdm0_fcr_iosr IOSR Integrator oversampling ratio (averaging length)
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm1_fcr DFSDM1FCR DFSDM filter control register
@{*/


#define DFSDM_DFSDM1_FCR_FORD_SHIFT		29
#define DFSDM_DFSDM1_FCR_FORD_MASK		0x07
/** @defgroup dfsdm_dfsdm1_fcr_ford FORD Sinc filter order
@{*/
/**@}*/


#define DFSDM_DFSDM1_FCR_FOSR_SHIFT		16
#define DFSDM_DFSDM1_FCR_FOSR_MASK		0x3ff
/** @defgroup dfsdm_dfsdm1_fcr_fosr FOSR Sinc filter oversampling ratio (decimation rate)
@{*/
/**@}*/


#define DFSDM_DFSDM1_FCR_IOSR_SHIFT		0
#define DFSDM_DFSDM1_FCR_IOSR_MASK		0xff
/** @defgroup dfsdm_dfsdm1_fcr_iosr IOSR Integrator oversampling ratio (averaging length)
@{*/
/**@}*/


/**@}*/

