grevaillot/svd_tools/headers/STM32H753x/dfsdm.h
/** @defgroup dfsdm_dfsdm2_fcr DFSDM2FCR DFSDM filter control register
@{*/


#define DFSDM_DFSDM2_FCR_FORD_SHIFT		29
#define DFSDM_DFSDM2_FCR_FORD_MASK		0x07
/** @defgroup dfsdm_dfsdm2_fcr_ford FORD Sinc filter order
@{*/
/**@}*/


#define DFSDM_DFSDM2_FCR_FOSR_SHIFT		16
#define DFSDM_DFSDM2_FCR_FOSR_MASK		0x3ff
/** @defgroup dfsdm_dfsdm2_fcr_fosr FOSR Sinc filter oversampling ratio (decimation rate)
@{*/
/**@}*/


#define DFSDM_DFSDM2_FCR_IOSR_SHIFT		0
#define DFSDM_DFSDM2_FCR_IOSR_MASK		0xff
/** @defgroup dfsdm_dfsdm2_fcr_iosr IOSR Integrator oversampling ratio (averaging length)
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm3_fcr DFSDM3FCR DFSDM filter control register
@{*/


#define DFSDM_DFSDM3_FCR_FORD_SHIFT		29
#define DFSDM_DFSDM3_FCR_FORD_MASK		0x07
/** @defgroup dfsdm_dfsdm3_fcr_ford FORD Sinc filter order
@{*/
/**@}*/


#define DFSDM_DFSDM3_FCR_FOSR_SHIFT		16
#define DFSDM_DFSDM3_FCR_FOSR_MASK		0x3ff
/** @defgroup dfsdm_dfsdm3_fcr_fosr FOSR Sinc filter oversampling ratio (decimation rate)
@{*/
/**@}*/


#define DFSDM_DFSDM3_FCR_IOSR_SHIFT		0
#define DFSDM_DFSDM3_FCR_IOSR_MASK		0xff
/** @defgroup dfsdm_dfsdm3_fcr_iosr IOSR Integrator oversampling ratio (averaging length)
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm0_jdatar DFSDM0JDATAR DFSDM data register for injected group
@{*/


#define DFSDM_DFSDM0_JDATAR_JDATA_SHIFT		8
#define DFSDM_DFSDM0_JDATAR_JDATA_MASK		0xffffff
/** @defgroup dfsdm_dfsdm0_jdatar_jdata JDATA Injected group conversion data
@{*/
/**@}*/


#define DFSDM_DFSDM0_JDATAR_JDATACH_SHIFT		0
#define DFSDM_DFSDM0_JDATAR_JDATACH_MASK		0x07
/** @defgroup dfsdm_dfsdm0_jdatar_jdatach JDATACH Injected channel most recently converted
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm1_jdatar DFSDM1JDATAR DFSDM data register for injected group
@{*/


#define DFSDM_DFSDM1_JDATAR_JDATA_SHIFT		8
#define DFSDM_DFSDM1_JDATAR_JDATA_MASK		0xffffff
/** @defgroup dfsdm_dfsdm1_jdatar_jdata JDATA Injected group conversion data
@{*/
/**@}*/


#define DFSDM_DFSDM1_JDATAR_JDATACH_SHIFT		0
#define DFSDM_DFSDM1_JDATAR_JDATACH_MASK		0x07
/** @defgroup dfsdm_dfsdm1_jdatar_jdatach JDATACH Injected channel most recently converted
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm2_jdatar DFSDM2JDATAR DFSDM data register for injected group
@{*/


#define DFSDM_DFSDM2_JDATAR_JDATA_SHIFT		8
#define DFSDM_DFSDM2_JDATAR_JDATA_MASK		0xffffff
/** @defgroup dfsdm_dfsdm2_jdatar_jdata JDATA Injected group conversion data
@{*/
/**@}*/


#define DFSDM_DFSDM2_JDATAR_JDATACH_SHIFT		0
#define DFSDM_DFSDM2_JDATAR_JDATACH_MASK		0x07
/** @defgroup dfsdm_dfsdm2_jdatar_jdatach JDATACH Injected channel most recently converted
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm3_jdatar DFSDM3JDATAR DFSDM data register for injected group
@{*/


#define DFSDM_DFSDM3_JDATAR_JDATA_SHIFT		8
#define DFSDM_DFSDM3_JDATAR_JDATA_MASK		0xffffff
/** @defgroup dfsdm_dfsdm3_jdatar_jdata JDATA Injected group conversion data
@{*/
/**@}*/


#define DFSDM_DFSDM3_JDATAR_JDATACH_SHIFT		0
#define DFSDM_DFSDM3_JDATAR_JDATACH_MASK		0x07
/** @defgroup dfsdm_dfsdm3_jdatar_jdatach JDATACH Injected channel most recently converted
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm0_rdatar DFSDM0RDATAR DFSDM data register for the regular channel
@{*/


#define DFSDM_DFSDM0_RDATAR_RDATA_SHIFT		8
#define DFSDM_DFSDM0_RDATAR_RDATA_MASK		0xffffff
/** @defgroup dfsdm_dfsdm0_rdatar_rdata RDATA Regular channel conversion data
@{*/
/**@}*/

/** DFSDM_DFSDM0_RDATAR_RPEND Regular channel pending data **/
#define DFSDM_DFSDM0_RDATAR_RPEND		(1 << 4)

#define DFSDM_DFSDM0_RDATAR_RDATACH_SHIFT		0
#define DFSDM_DFSDM0_RDATAR_RDATACH_MASK		0x07
/** @defgroup dfsdm_dfsdm0_rdatar_rdatach RDATACH Regular channel most recently converted
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm1_rdatar DFSDM1RDATAR DFSDM data register for the regular channel
@{*/


#define DFSDM_DFSDM1_RDATAR_RDATA_SHIFT		8
#define DFSDM_DFSDM1_RDATAR_RDATA_MASK		0xffffff
/** @defgroup dfsdm_dfsdm1_rdatar_rdata RDATA Regular channel conversion data
@{*/
/**@}*/

/** DFSDM_DFSDM1_RDATAR_RPEND Regular channel pending data **/
#define DFSDM_DFSDM1_RDATAR_RPEND		(1 << 4)

#define DFSDM_DFSDM1_RDATAR_RDATACH_SHIFT		0
#define DFSDM_DFSDM1_RDATAR_RDATACH_MASK		0x07
/** @defgroup dfsdm_dfsdm1_rdatar_rdatach RDATACH Regular channel most recently converted
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm2_rdatar DFSDM2RDATAR DFSDM data register for the regular channel
@{*/


#define DFSDM_DFSDM2_RDATAR_RDATA_SHIFT		8
#define DFSDM_DFSDM2_RDATAR_RDATA_MASK		0xffffff
/** @defgroup dfsdm_dfsdm2_rdatar_rdata RDATA Regular channel conversion data
@{*/
/**@}*/

/** DFSDM_DFSDM2_RDATAR_RPEND Regular channel pending data **/
#define DFSDM_DFSDM2_RDATAR_RPEND		(1 << 4)

#define DFSDM_DFSDM2_RDATAR_RDATACH_SHIFT		0
#define DFSDM_DFSDM2_RDATAR_RDATACH_MASK		0x07
/** @defgroup dfsdm_dfsdm2_rdatar_rdatach RDATACH Regular channel most recently converted
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm3_rdatar DFSDM3RDATAR DFSDM data register for the regular channel
@{*/


#define DFSDM_DFSDM3_RDATAR_RDATA_SHIFT		8
#define DFSDM_DFSDM3_RDATAR_RDATA_MASK		0xffffff
/** @defgroup dfsdm_dfsdm3_rdatar_rdata RDATA Regular channel conversion data
@{*/
/**@}*/

/** DFSDM_DFSDM3_RDATAR_RPEND Regular channel pending data **/
#define DFSDM_DFSDM3_RDATAR_RPEND		(1 << 4)

#define DFSDM_DFSDM3_RDATAR_RDATACH_SHIFT		0
#define DFSDM_DFSDM3_RDATAR_RDATACH_MASK		0x07
/** @defgroup dfsdm_dfsdm3_rdatar_rdatach RDATACH Regular channel most recently converted
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm0_awhtr DFSDM0AWHTR DFSDM analog watchdog high threshold register
@{*/


#define DFSDM_DFSDM0_AWHTR_AWHT_SHIFT		8
#define DFSDM_DFSDM0_AWHTR_AWHT_MASK		0xffffff
/** @defgroup dfsdm_dfsdm0_awhtr_awht AWHT Analog watchdog high threshold
@{*/
/**@}*/


#define DFSDM_DFSDM0_AWHTR_BKAWH_SHIFT		0
#define DFSDM_DFSDM0_AWHTR_BKAWH_MASK		0x0f
/** @defgroup dfsdm_dfsdm0_awhtr_bkawh BKAWH Break signal assignment to analog watchdog high threshold event
@{*/
/**@}*/


/**@}*/

