grevaillot/svd_tools/headers/STM32H753x/dfsdm.h
/** @defgroup dfsdm_dfsdm1_awhtr DFSDM1AWHTR DFSDM analog watchdog high threshold register
@{*/


#define DFSDM_DFSDM1_AWHTR_AWHT_SHIFT		8
#define DFSDM_DFSDM1_AWHTR_AWHT_MASK		0xffffff
/** @defgroup dfsdm_dfsdm1_awhtr_awht AWHT Analog watchdog high threshold
@{*/
/**@}*/


#define DFSDM_DFSDM1_AWHTR_BKAWH_SHIFT		0
#define DFSDM_DFSDM1_AWHTR_BKAWH_MASK		0x0f
/** @defgroup dfsdm_dfsdm1_awhtr_bkawh BKAWH Break signal assignment to analog watchdog high threshold event
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm2_awhtr DFSDM2AWHTR DFSDM analog watchdog high threshold register
@{*/


#define DFSDM_DFSDM2_AWHTR_AWHT_SHIFT		8
#define DFSDM_DFSDM2_AWHTR_AWHT_MASK		0xffffff
/** @defgroup dfsdm_dfsdm2_awhtr_awht AWHT Analog watchdog high threshold
@{*/
/**@}*/


#define DFSDM_DFSDM2_AWHTR_BKAWH_SHIFT		0
#define DFSDM_DFSDM2_AWHTR_BKAWH_MASK		0x0f
/** @defgroup dfsdm_dfsdm2_awhtr_bkawh BKAWH Break signal assignment to analog watchdog high threshold event
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm3_awhtr DFSDM3AWHTR DFSDM analog watchdog high threshold register
@{*/


#define DFSDM_DFSDM3_AWHTR_AWHT_SHIFT		8
#define DFSDM_DFSDM3_AWHTR_AWHT_MASK		0xffffff
/** @defgroup dfsdm_dfsdm3_awhtr_awht AWHT Analog watchdog high threshold
@{*/
/**@}*/


#define DFSDM_DFSDM3_AWHTR_BKAWH_SHIFT		0
#define DFSDM_DFSDM3_AWHTR_BKAWH_MASK		0x0f
/** @defgroup dfsdm_dfsdm3_awhtr_bkawh BKAWH Break signal assignment to analog watchdog high threshold event
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm0_awltr DFSDM0AWLTR DFSDM analog watchdog low threshold register
@{*/


#define DFSDM_DFSDM0_AWLTR_AWLT_SHIFT		8
#define DFSDM_DFSDM0_AWLTR_AWLT_MASK		0xffffff
/** @defgroup dfsdm_dfsdm0_awltr_awlt AWLT Analog watchdog low threshold
@{*/
/**@}*/


#define DFSDM_DFSDM0_AWLTR_BKAWL_SHIFT		0
#define DFSDM_DFSDM0_AWLTR_BKAWL_MASK		0x0f
/** @defgroup dfsdm_dfsdm0_awltr_bkawl BKAWL Break signal assignment to analog watchdog low threshold event
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm1_awltr DFSDM1AWLTR DFSDM analog watchdog low threshold register
@{*/


#define DFSDM_DFSDM1_AWLTR_AWLT_SHIFT		8
#define DFSDM_DFSDM1_AWLTR_AWLT_MASK		0xffffff
/** @defgroup dfsdm_dfsdm1_awltr_awlt AWLT Analog watchdog low threshold
@{*/
/**@}*/


#define DFSDM_DFSDM1_AWLTR_BKAWL_SHIFT		0
#define DFSDM_DFSDM1_AWLTR_BKAWL_MASK		0x0f
/** @defgroup dfsdm_dfsdm1_awltr_bkawl BKAWL Break signal assignment to analog watchdog low threshold event
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm2_awltr DFSDM2AWLTR DFSDM analog watchdog low threshold register
@{*/


#define DFSDM_DFSDM2_AWLTR_AWLT_SHIFT		8
#define DFSDM_DFSDM2_AWLTR_AWLT_MASK		0xffffff
/** @defgroup dfsdm_dfsdm2_awltr_awlt AWLT Analog watchdog low threshold
@{*/
/**@}*/


#define DFSDM_DFSDM2_AWLTR_BKAWL_SHIFT		0
#define DFSDM_DFSDM2_AWLTR_BKAWL_MASK		0x0f
/** @defgroup dfsdm_dfsdm2_awltr_bkawl BKAWL Break signal assignment to analog watchdog low threshold event
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm3_awltr DFSDM3AWLTR DFSDM analog watchdog low threshold register
@{*/


#define DFSDM_DFSDM3_AWLTR_AWLT_SHIFT		8
#define DFSDM_DFSDM3_AWLTR_AWLT_MASK		0xffffff
/** @defgroup dfsdm_dfsdm3_awltr_awlt AWLT Analog watchdog low threshold
@{*/
/**@}*/


#define DFSDM_DFSDM3_AWLTR_BKAWL_SHIFT		0
#define DFSDM_DFSDM3_AWLTR_BKAWL_MASK		0x0f
/** @defgroup dfsdm_dfsdm3_awltr_bkawl BKAWL Break signal assignment to analog watchdog low threshold event
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm0_awsr DFSDM0AWSR DFSDM analog watchdog status register
@{*/


#define DFSDM_DFSDM0_AWSR_AWHTF_SHIFT		8
#define DFSDM_DFSDM0_AWSR_AWHTF_MASK		0xff
/** @defgroup dfsdm_dfsdm0_awsr_awhtf AWHTF Analog watchdog high threshold flag
@{*/
/**@}*/


#define DFSDM_DFSDM0_AWSR_AWLTF_SHIFT		0
#define DFSDM_DFSDM0_AWSR_AWLTF_MASK		0xff
/** @defgroup dfsdm_dfsdm0_awsr_awltf AWLTF Analog watchdog low threshold flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm1_awsr DFSDM1AWSR DFSDM analog watchdog status register
@{*/


#define DFSDM_DFSDM1_AWSR_AWHTF_SHIFT		8
#define DFSDM_DFSDM1_AWSR_AWHTF_MASK		0xff
/** @defgroup dfsdm_dfsdm1_awsr_awhtf AWHTF Analog watchdog high threshold flag
@{*/
/**@}*/


#define DFSDM_DFSDM1_AWSR_AWLTF_SHIFT		0
#define DFSDM_DFSDM1_AWSR_AWLTF_MASK		0xff
/** @defgroup dfsdm_dfsdm1_awsr_awltf AWLTF Analog watchdog low threshold flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm2_awsr DFSDM2AWSR DFSDM analog watchdog status register
@{*/


#define DFSDM_DFSDM2_AWSR_AWHTF_SHIFT		8
#define DFSDM_DFSDM2_AWSR_AWHTF_MASK		0xff
/** @defgroup dfsdm_dfsdm2_awsr_awhtf AWHTF Analog watchdog high threshold flag
@{*/
/**@}*/


#define DFSDM_DFSDM2_AWSR_AWLTF_SHIFT		0
#define DFSDM_DFSDM2_AWSR_AWLTF_MASK		0xff
/** @defgroup dfsdm_dfsdm2_awsr_awltf AWLTF Analog watchdog low threshold flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm3_awsr DFSDM3AWSR DFSDM analog watchdog status register
@{*/


#define DFSDM_DFSDM3_AWSR_AWHTF_SHIFT		8
#define DFSDM_DFSDM3_AWSR_AWHTF_MASK		0xff
/** @defgroup dfsdm_dfsdm3_awsr_awhtf AWHTF Analog watchdog high threshold flag
@{*/
/**@}*/


#define DFSDM_DFSDM3_AWSR_AWLTF_SHIFT		0
#define DFSDM_DFSDM3_AWSR_AWLTF_MASK		0xff
/** @defgroup dfsdm_dfsdm3_awsr_awltf AWLTF Analog watchdog low threshold flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm0_awcfr DFSDM0AWCFR DFSDM analog watchdog clear flag register
@{*/


#define DFSDM_DFSDM0_AWCFR_CLRAWHTF_SHIFT		8
#define DFSDM_DFSDM0_AWCFR_CLRAWHTF_MASK		0xff
/** @defgroup dfsdm_dfsdm0_awcfr_clrawhtf CLRAWHTF Clear the analog watchdog high threshold flag
@{*/
/**@}*/


#define DFSDM_DFSDM0_AWCFR_CLRAWLTF_SHIFT		0
#define DFSDM_DFSDM0_AWCFR_CLRAWLTF_MASK		0xff
/** @defgroup dfsdm_dfsdm0_awcfr_clrawltf CLRAWLTF Clear the analog watchdog low threshold flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm1_awcfr DFSDM1AWCFR DFSDM analog watchdog clear flag register
@{*/


#define DFSDM_DFSDM1_AWCFR_CLRAWHTF_SHIFT		8
#define DFSDM_DFSDM1_AWCFR_CLRAWHTF_MASK		0xff
/** @defgroup dfsdm_dfsdm1_awcfr_clrawhtf CLRAWHTF Clear the analog watchdog high threshold flag
@{*/
/**@}*/


