grevaillot/svd_tools/headers/STM32H753x/dfsdm.h
#define DFSDM_DFSDM1_AWCFR_CLRAWLTF_SHIFT		0
#define DFSDM_DFSDM1_AWCFR_CLRAWLTF_MASK		0xff
/** @defgroup dfsdm_dfsdm1_awcfr_clrawltf CLRAWLTF Clear the analog watchdog low threshold flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm2_awcfr DFSDM2AWCFR DFSDM analog watchdog clear flag register
@{*/


#define DFSDM_DFSDM2_AWCFR_CLRAWHTF_SHIFT		8
#define DFSDM_DFSDM2_AWCFR_CLRAWHTF_MASK		0xff
/** @defgroup dfsdm_dfsdm2_awcfr_clrawhtf CLRAWHTF Clear the analog watchdog high threshold flag
@{*/
/**@}*/


#define DFSDM_DFSDM2_AWCFR_CLRAWLTF_SHIFT		0
#define DFSDM_DFSDM2_AWCFR_CLRAWLTF_MASK		0xff
/** @defgroup dfsdm_dfsdm2_awcfr_clrawltf CLRAWLTF Clear the analog watchdog low threshold flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm3_awcfr DFSDM3AWCFR DFSDM analog watchdog clear flag register
@{*/


#define DFSDM_DFSDM3_AWCFR_CLRAWHTF_SHIFT		8
#define DFSDM_DFSDM3_AWCFR_CLRAWHTF_MASK		0xff
/** @defgroup dfsdm_dfsdm3_awcfr_clrawhtf CLRAWHTF Clear the analog watchdog high threshold flag
@{*/
/**@}*/


#define DFSDM_DFSDM3_AWCFR_CLRAWLTF_SHIFT		0
#define DFSDM_DFSDM3_AWCFR_CLRAWLTF_MASK		0xff
/** @defgroup dfsdm_dfsdm3_awcfr_clrawltf CLRAWLTF Clear the analog watchdog low threshold flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm0_exmax DFSDM0EXMAX DFSDM Extremes detector maximum register
@{*/


#define DFSDM_DFSDM0_EXMAX_EXMAX_SHIFT		8
#define DFSDM_DFSDM0_EXMAX_EXMAX_MASK		0xffffff
/** @defgroup dfsdm_dfsdm0_exmax_exmax EXMAX Extremes detector maximum value
@{*/
/**@}*/


#define DFSDM_DFSDM0_EXMAX_EXMAXCH_SHIFT		0
#define DFSDM_DFSDM0_EXMAX_EXMAXCH_MASK		0x07
/** @defgroup dfsdm_dfsdm0_exmax_exmaxch EXMAXCH Extremes detector maximum data channel
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm1_exmax DFSDM1EXMAX DFSDM Extremes detector maximum register
@{*/


#define DFSDM_DFSDM1_EXMAX_EXMAX_SHIFT		8
#define DFSDM_DFSDM1_EXMAX_EXMAX_MASK		0xffffff
/** @defgroup dfsdm_dfsdm1_exmax_exmax EXMAX Extremes detector maximum value
@{*/
/**@}*/


#define DFSDM_DFSDM1_EXMAX_EXMAXCH_SHIFT		0
#define DFSDM_DFSDM1_EXMAX_EXMAXCH_MASK		0x07
/** @defgroup dfsdm_dfsdm1_exmax_exmaxch EXMAXCH Extremes detector maximum data channel
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm2_exmax DFSDM2EXMAX DFSDM Extremes detector maximum register
@{*/


#define DFSDM_DFSDM2_EXMAX_EXMAX_SHIFT		8
#define DFSDM_DFSDM2_EXMAX_EXMAX_MASK		0xffffff
/** @defgroup dfsdm_dfsdm2_exmax_exmax EXMAX Extremes detector maximum value
@{*/
/**@}*/


#define DFSDM_DFSDM2_EXMAX_EXMAXCH_SHIFT		0
#define DFSDM_DFSDM2_EXMAX_EXMAXCH_MASK		0x07
/** @defgroup dfsdm_dfsdm2_exmax_exmaxch EXMAXCH Extremes detector maximum data channel
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm3_exmax DFSDM3EXMAX DFSDM Extremes detector maximum register
@{*/


#define DFSDM_DFSDM3_EXMAX_EXMAX_SHIFT		8
#define DFSDM_DFSDM3_EXMAX_EXMAX_MASK		0xffffff
/** @defgroup dfsdm_dfsdm3_exmax_exmax EXMAX Extremes detector maximum value
@{*/
/**@}*/


#define DFSDM_DFSDM3_EXMAX_EXMAXCH_SHIFT		0
#define DFSDM_DFSDM3_EXMAX_EXMAXCH_MASK		0x07
/** @defgroup dfsdm_dfsdm3_exmax_exmaxch EXMAXCH Extremes detector maximum data channel
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm0_exmin DFSDM0EXMIN DFSDM Extremes detector minimum register
@{*/


#define DFSDM_DFSDM0_EXMIN_EXMIN_SHIFT		8
#define DFSDM_DFSDM0_EXMIN_EXMIN_MASK		0xffffff
/** @defgroup dfsdm_dfsdm0_exmin_exmin EXMIN Extremes detector minimum value
@{*/
/**@}*/


#define DFSDM_DFSDM0_EXMIN_EXMINCH_SHIFT		0
#define DFSDM_DFSDM0_EXMIN_EXMINCH_MASK		0x07
/** @defgroup dfsdm_dfsdm0_exmin_exminch EXMINCH Extremes detector minimum data channel
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm1_exmin DFSDM1EXMIN DFSDM Extremes detector minimum register
@{*/


#define DFSDM_DFSDM1_EXMIN_EXMIN_SHIFT		8
#define DFSDM_DFSDM1_EXMIN_EXMIN_MASK		0xffffff
/** @defgroup dfsdm_dfsdm1_exmin_exmin EXMIN Extremes detector minimum value
@{*/
/**@}*/


#define DFSDM_DFSDM1_EXMIN_EXMINCH_SHIFT		0
#define DFSDM_DFSDM1_EXMIN_EXMINCH_MASK		0x07
/** @defgroup dfsdm_dfsdm1_exmin_exminch EXMINCH Extremes detector minimum data channel
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm2_exmin DFSDM2EXMIN DFSDM Extremes detector minimum register
@{*/


#define DFSDM_DFSDM2_EXMIN_EXMIN_SHIFT		8
#define DFSDM_DFSDM2_EXMIN_EXMIN_MASK		0xffffff
/** @defgroup dfsdm_dfsdm2_exmin_exmin EXMIN Extremes detector minimum value
@{*/
/**@}*/


#define DFSDM_DFSDM2_EXMIN_EXMINCH_SHIFT		0
#define DFSDM_DFSDM2_EXMIN_EXMINCH_MASK		0x07
/** @defgroup dfsdm_dfsdm2_exmin_exminch EXMINCH Extremes detector minimum data channel
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm3_exmin DFSDM3EXMIN DFSDM Extremes detector minimum register
@{*/


#define DFSDM_DFSDM3_EXMIN_EXMIN_SHIFT		8
#define DFSDM_DFSDM3_EXMIN_EXMIN_MASK		0xffffff
/** @defgroup dfsdm_dfsdm3_exmin_exmin EXMIN Extremes detector minimum value
@{*/
/**@}*/


#define DFSDM_DFSDM3_EXMIN_EXMINCH_SHIFT		0
#define DFSDM_DFSDM3_EXMIN_EXMINCH_MASK		0x07
/** @defgroup dfsdm_dfsdm3_exmin_exminch EXMINCH Extremes detector minimum data channel
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm0_cnvtimr DFSDM0CNVTIMR DFSDM conversion timer register
@{*/


#define DFSDM_DFSDM0_CNVTIMR_CNVCNT_SHIFT		4
#define DFSDM_DFSDM0_CNVTIMR_CNVCNT_MASK		0xfffffff
/** @defgroup dfsdm_dfsdm0_cnvtimr_cnvcnt CNVCNT 28-bit timer counting conversion time
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm1_cnvtimr DFSDM1CNVTIMR DFSDM conversion timer register
@{*/


#define DFSDM_DFSDM1_CNVTIMR_CNVCNT_SHIFT		4
#define DFSDM_DFSDM1_CNVTIMR_CNVCNT_MASK		0xfffffff
/** @defgroup dfsdm_dfsdm1_cnvtimr_cnvcnt CNVCNT 28-bit timer counting conversion time
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm2_cnvtimr DFSDM2CNVTIMR DFSDM conversion timer register
@{*/


#define DFSDM_DFSDM2_CNVTIMR_CNVCNT_SHIFT		4
#define DFSDM_DFSDM2_CNVTIMR_CNVCNT_MASK		0xfffffff
/** @defgroup dfsdm_dfsdm2_cnvtimr_cnvcnt CNVCNT 28-bit timer counting conversion time
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm3_cnvtimr DFSDM3CNVTIMR DFSDM conversion timer register
@{*/


#define DFSDM_DFSDM3_CNVTIMR_CNVCNT_SHIFT		4
#define DFSDM_DFSDM3_CNVTIMR_CNVCNT_MASK		0xfffffff
/** @defgroup dfsdm_dfsdm3_cnvtimr_cnvcnt CNVCNT 28-bit timer counting conversion time
@{*/
/**@}*/


/**@}*/
